[
 {
 "year":2017,
 "id": "SKFKS17",
 "authors": ["Steffen Smolka", David Kahn","Praveen Kumar", "Nate Foster", "Dexter Kozen","Alexandra Silva"],
 "title": "Deciding probabilistic program equivalence in NetKAT.",
 "journal": {
 "name": "CoRR",
 "volume": "arXiv:1707.02772",
 "note": "Draft"
 },
 "download": "http://arxiv.org/abs/1707.02772",
 "abstract": "<p>We tackle the problem of deciding whether a pair of probabilistic programs are equivalent in the context of Probabilistic NetKAT, a formal language for reasoning about the behavior of packet-switched networks. We show that the problem is decidable for the history-free fragment of the language. The main challenge lies in reasoning about iteration, which we address by a reduction to finite-state absorbing Markov chains. This approach naturally leads to an effective decision procedure based on stochastic matrices that we have implemented in an OCaml prototype. We demonstrate how to use this prototype to reason about probabilistic network programs.</p>"
 },
 {
 "year": 2017,
 "id": "KMS17",
 "authors": ["Konstantinos Mamouras", "Dexter Kozen", "Alexandra Silva"],
 "title": "Completeness and incompleteness in nominal Kleene algebra",
 "journal": {
 "name": "J. Logical and Algebraic Methods in Programming",
 "volume":="91",
 "pages":""17--32",
 "note": "Special issue RAMICS 2015."
 },
 "download": "http://www.cs.cornell.edu/~kozen/papers/NKA.pdf",
 "abstract": "<p>Gabbay and Ciancia (2011) presented a nominal extension of Kleene algebra as a framework for trace semantics with statically scoped allocation of resources, along with a semantics consisting of nominal languages. They also provided an axiomatization that captures the behavior of the scoping operator and its interaction with the Kleene algebra operators and proved soundness over nominal languages. In this paper, we show that the axioms proposed by Gabbay and Ciancia are not complete over the semantic interpretation they propose. We then identify a slightly wider class of language models over which they are sound and complete.</p>"
 
 },
 {
 "year": 2017,
 "id": "BKKS",
 "authors": ["Harsh Beohar", "Sebastian Küper", "Barbara König", "Alexandra Silva"],
 "title": "Conditional Transition Systems with Upgrades",
 "conference": {
 "name": "11th Theoretical Aspects of Software Engineering Conference (TASE 2017)",
 "location": "Nice, France",
 "url": "http://tase2017.unice.fr/"
 },
 "download": "https://arxiv.org/abs/1706.02526",
 "abstract": "<p>We introduce a variant of transition systems, where activation of transitions depends on conditions of the environment and upgrades during runtime potentially create additional transitions. Using a cornerstone result in lattice theory, we show that such transition systems can be modelled in two ways: as conditional transition systems (CTS) with a partial order on conditions, or as lattice transition systems (LaTS), where transitions are labelled with the elements from a distributive lattice. We define equivalent notions of bisimilarity for both variants and characterise them via a bisimulation game. We explain how conditional transition systems are related to featured transition systems for the modelling of software product lines. Furthermore, we show how to compute bisimilarity symbolically via BDDs by defining an operation on BDDs that approximates an element of a Boolean algebra into a lattice. We have implemented our procedure and provide runtime results.</p>"
 },
        {
             "year": 2017,
             "id": "BS17",
             "authors": ["Ahmed Bouajjani", "Alexandra Silva"],
             "title": "Proceedings of Formal Techniques for Distributed Objects, Components, and Systems - 37th IFIP WG 6.1 International Conference, FORTE 2017, Held as Part of the 12th International Federated Conference on Distributed Computing Techniques, DisCoTec 2017, Neuchâtel, Switzerland, June 19-22, 2017",
             "edited": {
             "publisher": "Springer",
             "series": "Lecture Notes in Computer Science",
             "volume": 10321,
             "pages": "1-2",
             "url": "https://link.springer.com/book/10.1007%2F978-3-319-60225-7"
             }
             },
 {
 "year":2017,
 "id": "HSS17",
 "authors": ["Gerco van Heerdt","Matteo Sammartino", "Alexandra Silva"],
 "title": "Learning Automata with Side-Effects.",
 "journal": {
 "name": "CoRR",
 "volume": "arXiv:1704.08055",
 "note": "Draft"
 },
 "download": "https://arxiv.org/abs/1704.08055",
 "abstract": "<p>Automata learning has been successfully applied in the verification of hardware and software. The size of the automaton model learned is a bottleneck for scalability and hence optimizations that enable learning of compact representations are important. In this paper, we continue the development of a general framework for automata learning based on category theory and develop a class of optimizations and an accompanying correctness proof for learning algorithms. The new algorithm is parametric on a monad, which provides a rich algebraic structure to capture non-determinism and other side-effects. These side-effects are used to learn more compact automaton models and the abstract categorical approach enables us to capture several possible optimizations under the same (p)roof.</p>"
 },
  {
  "year":2017,
  "id": "HSS17",
  "authors": ["Filippo Bonchi", "Alexandra Silva", "Ana Sokolova"],
  "title": "The Power of Convex Algebras.",
  "conference": {
  "name": "28th International Conference on Concurrency Theory (CONCUR 2017)",
  "location": "Berlin, Germany",
  "url": "https://www.concur2017.tu-berlin.de/"
  },
  "download": "https://arxiv.org/abs/1707.02344",
  "abstract": "<p>Probabilistic automata (PA) combine probability and nondeterminism. They can be given different semantics, like strong bisimilarity, convex bisimilarity, or (more recently) distribution bisimilarity. The latter is based on the view of PA as transformers of probability distributions, also called belief states, and promotes distributions to first-class citizens. We give a coalgebraic account of the latter semantics, and explain the genesis of the belief-state transformer from a PA. To do so, we make explicit the convex algebraic structure present in PA and identify belief-state transformers as transition systems with state space that carries a convex algebra. As a consequence of our abstract approach, we can give a sound proof technique which we call bisimulation up-to convex hull.</p>"
  },
  {
  "year":2017,
  "id": "HSS17",
  "authors": ["Tobias Kappe","Paul Brunet", "Bas Luttik", "Alexandra Silva", "Fabio Zanasi"],
  "title": "Brzozowski Goes Concurrent-A Kleene Theorem for Pomset Languages.",
  "conference": {
  "name": "28th International Conference on Concurrency Theory (CONCUR 2017)",
  "location": "Berlin, Germany",
  "url": "https://www.concur2017.tu-berlin.de/"
  },
  "download": "https://arxiv.org/abs/1704.07199",
  "abstract": "<p>Concurrent Kleene Algebra (CKA) is a mathematical formalism to study programs that exhibit concurrent behaviour. As with previous extensions of Kleene Algebra, characterizing the free model is crucial in order to develop the foundations of the theory and potential applications. For CKA, this has been an open question for a few years and this paper makes an important step towards an answer. We present a new automaton model and a Kleene-like theorem that relates a relaxed version of CKA to series-parallel pomset languages, which are a natural candidate for the free model. There are two substantial differences with previous work: from expressions to automata, we use Brzozowski derivatives, which enable a direct construction of the automaton; from automata to expressions, we provide a syntactic characterization of the automata that denote valid CKA behaviours.</p>"
  },
  {
  "year":2017,
  "id": "HSS17",
  "authors": ["Gerco van Heerdt","Matteo Sammartino", "Alexandra Silva"],
  "title": "CALF: Categorical Automata Learning Framework.",
  "conference": {
  "name": "26th EACSL Annual Conference on Computer Science Logic (CSL 2017)",
  "location": "Stockholm, Sweden",
  "url": "https://www.math-stockholm.se/konferenser-och-akti/logic-in-stockholm-2/26th-eacsl-annual-co/computer-science-logic-2017-august-20-24-1.717663"
  },
  "download": "https://arxiv.org/abs/1704.05676",
  "abstract": "<p>Automata learning is a technique that has successfully been applied in verification, with the automaton type varying depending on the application domain. Adaptations of automata learning algorithms for increasingly complex types of automata have to be developed from scratch because there was no abstract theory offering guidelines. This makes it hard to devise such algorithms, and it obscures their correctness proofs. We introduce a simple category-theoretic formalism that provides an appropriately abstract foundation for studying automata learning. Furthermore, our framework establishes formal relations between algorithms for learning, testing, and minimization. We illustrate its generality with two examples: deterministic and weighted automata.</p>"
  },
 {
 "year":2017,
 "id": "AS17",
 "authors": ["Alexandra Silva"],
 "title": "Brzozowski Goes Concurrent-A Kleene Theorem for Pomset Languages (Invited Talk)",
 "conference": {
 "name": "2nd International Conference on Formal Structures for Computation and Deduction (FSCD 2017)",
 "location": "Oxford, UK",
 "url": "https://www.cs.ox.ac.uk/conferences/fscd2017/"
 },
 "download": "http://drops.dagstuhl.de/opus/volltexte/2017/7744/pdf/LIPIcs-FSCD-2017-3.pdf",
 "abstract": "<p>Concurrent Kleene Algebra (CKA) is a mathematical formalism to study programs that exhibit concurrent behaviour. As with previous extensions of Kleene Algebra, characterizing the free model is crucial in order to develop the foundations of the theory and potential applications. For CKA, this has been an open question for a few years and this talk will overview why the problem is so difficult. We will then pave the way towards a solution, by presenting a new automaton model and a Kleene-like theorem for CKA. More precisely, we connect a relaxed version of CKA to series-parallel pomset languages, which are a natural candidate for the free model. There are two substantial differences with previous work: from expressions to automata, we use Brzozowski derivatives, which enable a direct construction of the automaton; from automata to expressions, we provide a syntactic characterization of the automata that denote valid CKA behaviours. We also survey how the present work can be used to to extend the network specification language  NetKAT with primitives for concurrency so as to model and reason about concurrency within networks. This is joint work with Tobias Kappe, Paul Brunet, Bas Luttik, and Fabio Zanasi.</p>"
 },
 {
 "year": 2017,
 "id": "EHHPS17",
 "authors": ["Joerg Endrullis", "Helle Hansen", "Dimitri Hendriks", "Andrew Polonsky", "Alexandra Silva"],
 "title": "Coinductive Foundations of Infinitary Rewriting and Infinitary Equational Logic",
 "journal": {
 "name": "Logical Methods in Computer Science",
 "note": "Special issue RTA 2015"
 },
 "download": "https://arxiv.org/abs/1706.00677",
 "abstract": "<p>We present a coinductive framework for defining and reasoning about the infinitary analogues of equational logic and term rewriting in a uniform, coinductive way. The setup captures rewrite sequences of arbitrary ordinal length, but it has neither the need for ordinals nor for metric convergence. This makes the framework especially suitable for formalizations in theorem provers.</p>"
 },
 {
 "year": 2017,
 "id": "JKS17",
 "authors": ["Jean-Baptiste Jeannin", "Dexter Kozen", "Alexandra Silva"],
 "title": "CoCaml: Functional Programming with Regular Coinductive Types",
 "journal": {
 "name": "Fundamenta Informaticae",
 "volume" : 150,
 "pages" : "347-377"
 },
 "download": "https://pdfs.semanticscholar.org/cce1/d08165dab790b8f242ba057e9c9ae1432c5f.pdf",
 "abstract": "<p>Functional languages offer a high level of abstraction, which results in programs that are elegant and easy to understand. Central to the development of functional programming are inductive and coinductive types and associated programming constructs, such as pattern-matching. Whereas inductive types have a long tradition and are well supported in most languages, coinduc- tive types are subject of more recent research and are less mainstream.</p><p>We present CoCaml, a functional programming language extending OCaml, which allows us to define recursive functions on regular coinductive datatypes. These functions are defined like usual recursive functions, but parameterized by an equation solver. We present a full implementation of all the constructs and solvers and show how these can be used in a variety of examples, including operations on infinite lists, infinitary lambda-terms, and p-adic numbers.</p>"
 
 },
 {
 "year":2017,
 "id": "SKFKS17",
 "authors": ["Steffen Smolka", "Praveen Kumar", "Nate Foster", "Dexter Kozen","Alexandra Silva"],
 "title": " Cantor meets Scott: Domain-theoretic foundations for probabilistic network programming.",
 "conference": {
 "name": "POPL 2017: 44th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages",
 "location": "Paris, France",
 "url": "http://conf.researchr.org/home/POPL-2017"
 },
 "download": "https://arxiv.org/pdf/1607.05830.pdf",
 "abstract": "<p>ProbNetKAT is a probabilistic extension of NetKAT with a denotational semantics based on Markov kernels. The language is expressive enough to generate continuous distributions, which raises the question of how to compute effectively in the language. This paper gives an new characterization of ProbNetKAT’s semantics using domain theory, which provides the foundation needed to build a practical implementation. We show how to use the semantics to approximate the behavior of arbitrary ProbNetKAT programs using distributions with finite support. We develop a prototype implemen- tation and show how to use it to solve a variety of problems including characterizing the expected congestion induced by different routing schemes and reasoning probabilistically about reachability in a network.</p>"
 },
 {
 "year":2017,
 "id": "MSSKS17",
 "authors": ["Joshua Moerman", "Matteo Sammartino", "Alexandra Silva", "Bartek Klin", "Michal Szynwelski"],
 "title": "Learning nominal automata.",
 "conference": {
 "name": "POPL 2017: 44th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages",
 "location": "Paris, France",
 "url": "http://conf.researchr.org/home/POPL-2017"
 },
 "download": "https://arxiv.org/pdf/1607.06268.pdf",
 "abstract": "<p>We present an Angluin-style algorithm to learn nominal automata, which are acceptors of languages over infinite (structured) alphabets. The abstract approach we take allows us to seamlessly extend known variations of the algorithm to this new setting. In particular we can learn a subclass of nominal non-deterministic automata. An implementation using a recently developed Haskell library for nominal computation is provided for preliminary experiments.</p>"
 },
 {
 "year": 2016,
 "id": "BKKSW",
 "authors": ["Harsh Beohar", "Sebastian Küper", "Barbara König", "Alexandra Silva","Thorsten Wißmann"],
 "title": "A coalgebraic treatment of conditional transition systems with upgrades",
 "journal": {
 "name": "CoRR",
 "volume": "arXiv:1612.05002",
 "note": "Draft"
 },
 "download": "https://arxiv.org/pdf/1612.05002.pdf",
 "abstract": "<p>We consider conditional transition systems, that allow to model software product lines with upgrades, in a coalgebraic setting. We show that, by using Birkhoff's duality for distributive lattices, we obtain two equivalent Kleisli categories in which these coalgebras live: Kleisli categories based on the reader and on the so-called lattice monad over 𝖯𝗈𝗌𝖾𝗍. We study two different functors describing the branching type of the coalgebra and investigate the resulting behavioural equivalence. Furthermore we show how an existing algorithm for coalgebra minimisation can be instantiated to derive behavioural equivalences in this setting.</p>"
 
 },
 {
 "year": 2016,
 "id": "BCS16",
 "authors": ["Luís Barbosa", "Alcino Cunha", "Alexandra Silva"],
 "title": "Quien sabe por Algebra, sabe scientificamente. Special issue with selected contributions dedicated to José Nuno Oliveira on the occasion of his 60th birthday.",
 "edited": {
 "publisher": "Elsevier",
 "series": "Journal of Logical and Algebraic Methods in Programming",
 "volume": 5,
 "issue": 85
 }
 },
 {
 "year": 2016,
 "id": "BBCRS14",
 "authors": ["Filippo Bonchi", "Marcello Bonsangue", "Georgiana Caltais", "Jan Rutten", "Alexandra Silva"],
 "title": "A coalgebraic view on decorated traces.",
 "journal": {
 "name": "Mathematical Structures in Computer Science",
 "volume" : 26,
 "issue": 7,
 "pages" : "1234-1268"
 },
 "download": "/files/new-dec-traces-mscs.pdf",
 "abstract": "<p>In concurrency theory, various semantic equivalences on transition systems are based on traces decorated with some additional observations, generally referred to as decorated traces. Using the generalized powerset construction, recently introduced by a subset of the authors, we give a coalgebraic presentation of decorated trace semantics. The latter include ready, failure, (complete) trace, possible-futures, ready trace and failure trace semantics for labeled transition systems, and ready, (maximal) failure and (maximal) trace semantics for generative probabilistic systems.  This yields a uniform notion of minimal representatives for the various decorated trace equivalences, in terms of final Moore automata. As a consequence, proofs of decorated trace equivalence can be given by coinduction, using different types of (Moore-) bisimulation (up-to context).</p>"
 
 },
 {
 "year":2016,
 "id": "AS16b",
 "authors": ["Alexandra Silva"],
 "title": "Coalgebraic Learning (Invited Talk)",
 "conference": {
 "name": "25th EACSL Annual Conference on Computer Science Logic (CSL 2016)",
 "location": "Marseille, France",
 "url": "http://csl16.lif.univ-mrs.fr"
 },
 "download": "http://drops.dagstuhl.de/opus/volltexte/2016/6545/pdf/LIPIcs-CSL-2016-5.pdf",
 "abstract": "<p>The area of automata learning was pioneered by Angluin in the 80's. Her original algorithm, which applied to regular languages and deterministic automata, has been extended to various types of automata and used in software and hardware verification. In this talk, we will take an abstract perspective at automata learning. We show how the correctness of the original algorithm and many extensions can be captured in one proof using coalgebraic techniques. We also show that a novel algorithm for nominal automata can be derived from the abstract framework.</p>"
 },
 {
 "year": 2016,
 "id": "AS16",
 "authors": ["Alexandra Silva"],
 "title": "Report on the POPL mentoring workshop (PLMW 2016)",
 "journal":
 {
 "name": "ACM SIGLOG News",
 "volume" : 3,
 "number" : 2,
 "pages" : "82-83"
 },
 "download": "http://dl.acm.org/citation.cfm?id=2948909"
 },
 {
 "year":2016,
 "id": "KPS16",
 "authors": ["Robbert Krebbers", "Louis Parlant", "Alexandra Silva"],
 "title": "Moessner's Theorem: An Exercise in Coinductive Reasoning in Coq.",
 "conference": {
 "name": "Theory and Practice of Formal Methods 2016 (in honor of Frank de Boer's 60th birthday)",
 "pages": "309--324",
 "location": "Eindhoven, The Netherlands"
 },
 "download": "http://discovery.ucl.ac.uk/1492921/1/moessner.pdf",
 "abstract": "<p>Moessner's Theorem describes a construction of the sequence of powers (1^n, 2^n, 3^n, ...), by repeatedly dropping and summing elements from the sequence of positive natural numbers. The theorem was presented by Moessner in 1951 without a proof and later proved and gen- eralized in several directions. More recently, a coinductive proof of the original theorem was given by Niqui and Rutten. We present a formaliza- tion of their proof in the Coq proof assistant. This formalization serves as a non-trivial illustration of the use of coinduction in Coq. During the formalization, we discovered that Long and Sali ́e’s generalizations could also be proved using (almost) the same bisimulation.</p>"
 },
 {
  "year": 2016,
  "id": "FKMRS16",
  "authors": ["Nate Foster", "Dexter Kozen", "Konstantinos Mamouras", "Mark Reitblatt","Alexandra Silva"],
  "title": "Probabilistic NetKAT.",
  "conference": {
  "name": "25th European Symposium on Programming, ESOP 2016",
  "location": "Eindhoven, The Netherlands",
  "url": "http://www.etaps.org/index.php/2016/esop",
  "series": "LNCS",
  "volume": "9632",
  "pages": "282--309",
  "note": "An earlier version of this paper appeared as Cornell Technical report (see below)"
  },
  "download": "https://www.cs.cornell.edu/~kozen/papers/probnetkat.pdf",
  "abstract": "<p>This paper develops a new language for programming software-defined networks based on a probabilistic semantics. We extend the NetKAT language with new primitives for expressing probabilistic behaviors and enrich the semantics from one based on deterministic functions to one based on measures and measurable functions on sets of packet histories. We establish fundamental properties of the semantics, prove that it is a conservative extension of the deterministic semantics, and show that it satisfies a number of natural equations. We present case studies that show how the language can be used to model a diverse collection of scenarios drawn from real-world networks.</p>"
  
  },
{
  "year": 2015,
  "id": "FKMRS15",
  "authors": ["Nate Foster", "Dexter Kozen", "Konstantinos Mamouras", "Mark Reitblatt","Alexandra Silva"],
  "title": " Probabilistic NetKAT.",
  "techreport": {
  "type": "Technical Report",
  "number": "1813/40335",
  "institution": "Cornell University"
  },
  "download": "http://hdl.handle.net/1813/40335",
  "abstract": "<p>This paper develops a new language for programming software-defined networks based on a probabilistic semantics. We extend the NetKAT language with new primitives for expressing probabilistic behaviors and enrich the semantics from one based on deterministic functions to one based on measures and measurable functions on sets of packet histories. We establish fundamental properties of the semantics, prove that it is a conservative extension of the deterministic semantics, and show that it satisfies a number of natural equations. We present case studies that show how the language can be used to model a diverse collection of scenarios drawn from real-world networks.</p>"
  
  },
 {
 "year":2015,
 "id": "AS15",
 "authors": ["Alexandra Silva"],
 "title": "Applications of Automata and Concurrency Theory in Networks (Invited Talk)",
 "conference": {
 "name": "26th International Conference on Concurrency Theory (CONCUR 2015)",
 "location": "Madrid, Spain",
 "url": "http://drops.dagstuhl.de/opus/volltexte/2015/5399/pdf/39.pdf"
 },
 "download": "http://drops.dagstuhl.de/opus/volltexte/2016/6545/pdf/LIPIcs-CSL-2016-5.pdf",
 "abstract": "<p>Networks have received widespread attention in recent years as a target for domain-specific language design. The emergence of software-defined networking (SDN) as a popular paradigm for network programming has led to the appearance of a number of SDN programming languages seeking to provide high-level abstractions to simplify the task of specifying the packet-processing behavior of a network.</p><p>Previous work by Anderson et al. [1] introduced NetKAT, a language and logic for specifying and verifying the packet-processing behavior of networks. NetKAT provides general-purpose pro- gramming constructs such as parallel and sequential composition, conditional tests, and iteration, as well as special-purpose primitives for querying and modifying packet headers and encoding network topologies. In contrast to competing approaches, NetKAT has a formal mathematical semantics and an equational deductive system that is sound and complete over that semantics, as well as a PSPACE decision procedure. It is based on Kleene algebra with tests (KAT), an algebraic system for propositional program verification that has been extensively studied for nearly two decades [3]. Several practical applications of NetKAT have been developed, including algorithms for testing reachability and non-interference and a syntactic correctness proof for a compiler that translates programs to hardware instructions for SDN switches.</p><p> In a follow-up paper [2], the coalgebraic theory of NetKAT was developed and a bisimulation- based algorithm for deciding equivalence was devised. The new algorithm was shown to be significantly more efficient than the previous naive algorithm [1], which was PSPACE in the best case and the worst case, as it was based on the determinization of a nondeterministic algorithm. Along with the coalgebraic model of NetKAT, the authors presented a specialized version of the Brzozowski derivative in both semantic and syntactic forms. They also also proved a version of Kleene’s theorem for NetKAT that shows that the coalgebraic model is equivalent to the standard packet-processing and language models introduced previously [1]. They demonstrated the real- world applicability of the tool by using it to decide common network verification questions such as all-pairs connectivity, loop-freedom, and translation validation – all pressing questions in modern networks.</p><p>This talk will survey applications of automata theory, concurrency theory and coalgebra to problems in networking. We will suggest directions for exploring the bridge between the two communities and ways to deliver new synergies. On the one hand, this will lead to new insights and techniques that will enable the development of rigorous semantic foundations for networks. On the other hand, the idysiocransies of networks will provide new challenges for the automata and concurrency community.</p>"
 },
 {
  "year": 2015,
  "id": "KMS15",
  "authors": ["Konstantinos Mamouras", "Dexter Kozen", "Alexandra Silva"],
  "title": "Completeness and incompleteness in nominal Kleene algebra",
  "conference": {
  "name": "RAMICS 2015, 15th International Conference on Relational and Algebraic Methods in Computer Science",
  "location": "Braga, Portugal",
  "series": "LNCS",
  "volume": 0,
  "url": "http://ramics2015.di.uminho.pt"
  },
  "download": "http://alexandrasilva.org/files/NKA-RAMiCS-Final.pdf",
  "abstract": "<p>Gabbay and Ciancia (2011) presented a nominal extension of Kleene algebra as a framework for trace semantics with dynamic allocation of resources, along with a semantics consisting of nominal languages. They also provided an axiomatization that captures the behavior of the scoping operator and its interaction with the Kleene algebra operators and proved soundness over nominal languages. In this paper we show that the axioms are complete and describe the free language models.</p>"
  
  },
  {
 "year": 2015,
 "id": "KMPS15",
 "authors": ["Konstantinos Mamouras", "Dexter Kozen", "Daniela Petrisan", "Alexandra Silva"],
 "title": "Nominal Kleene Coalgebra",
 "conference": {
 "name": "ICALP 2015, 42nd International Colloquium on Automata, Languages, and Programming",
 "location": "Kyoto, Japan",
 "series": "LNCS",
 "volume": 9135,
 "pages": "286-298",
 "url": "http://www.kurims.kyoto-u.ac.jp/icalp2015/"
 },
 "download": "http://link.springer.com/chapter/10.1007%2F978-3-662-47666-6_23",
 "abstract": "<p>We develop the coalgebraic theory of nominal Kleene algebra, including an alternative language-theoretic semantics, a nominal extension of the Brzozowski derivative, and a bisimulation-based decision procedure for the equational theory.</p>"
 
 },
 {
  "year": 2015,
  "id": "EHHPS15",
  "authors": ["Joerg Endrullis", "Helle Hansen", "Dimitri Hendriks", "Andrew Polonsky", "Alexandra Silva"],
  "title": "A Coinductive Framework for Infinitary Rewriting and Equational Reasoning",
  "conference": {
  "name": "RTA 2015, 26th International Conference on Rewriting Techniques and Applications",
  "location": "Warsaw, Poland",
   "note": "Best paper award",
   "url": "http://rdp15.mimuw.edu.pl/index.php?site=rta"
  },
  "download": "http://arxiv.org/abs/1505.01128",
  "abstract": "<p>We present a coinductive framework for defining infinitary analogues of equational reasoning and rewriting in a uniform way. We define the relation =^infty, notion of infinitary equational reasoning, and ->^infty, the standard notion of infinitary rewriting as follows: =^infty := nu R. ( <-_root + ->_root + lift(R) )^* ->^infty := mu R. nu S. ( ->_root + lift(R) )^* ; lift(S) where lift(R) := { (f(s_1,...,s_n), f(t_1,...,t_n)) | s_1 R t_1,...,s_n R t_n } + id , and where mu is the least fixed point operator and nu is the greatest fixed point operator. The setup captures rewrite sequences of arbitrary ordinal length, but it has neither the need for ordinals nor for metric convergence. This makes the framework especially suitable for formalizations in theorem provers.</p>"
  },
 {
 "year": 2015,
 "id": "BMSZ15",
 "authors": ["Filippo Bonchi", "Stefan Milius", "Alexandra Silva", "Fabio Zanasi"],
 "title": "Killing epsilons with a dagger: A coalgebraic study of systems with algebraic label structure",
 "journal": {
 "name": "Theoretical Computer Science",
 "note": "This is an extended version of our CMCS 2014 paper (see below)."
 },
 "download": "http://www.sciencedirect.com/science/article/pii/S0304397515002406",
 "abstract": "<p>We propose an abstract framework for modelling state-based systems with internal behaviour as e.g. given by silent or ϵ-transitions. Our approach employs monads with a parametrized fixpoint operator † to give a semantics to those systems and implement a sound procedure of abstraction of the internal transitions, whose labels are seen as the unit of a free monoid. More broadly, our approach extends the standard coalgebraic framework for state-based systems by taking into account the algebraic structure of the labels of their transitions. This allows to consider a wide range of other examples, including Mazurkiewicz traces for concurrent systems and non-deterministic transducers.</p>"
 
 },
 {
 "year": 2015,
 "id": "AS15",
 "authors": ["Alexandra Silva"],
 "title": "A short introduction to the coalgebraic method.",
 "journal":
     {
 "name": "ACM SIGLOG News",
 "volume" : 2,
 "number" :2,
 "pages" : "16-27"
   },
  "download": "http://dl.acm.org/citation.cfm?id=2766193",
  "abstract": "<p>This article contains a brief introduction to coalgebra and an overview of a recent proof of correctness for Brzozowski's algorithm which uses coalgebraic techniques. In the discussion section we briefly discuss the most active research lines in the coalgebra community and take a personal outlook at what future might bring for the field.</p>"
  
  },
 {
  "year": 2015,
  "id": "FKMST14",
  "authors": ["Nate Foster", "Dexter Kozen", "Matthew Milano", "Alexandra Silva", "Laure Thompson"],
  "title": "A coalgebraic decision procedure for NetKAT.",
  "conference": {
    "name": "POPL 2015: 42nd ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages",
    "location": "Mumbai, India",
    "url": "http://popl.mpi-sws.org/2015"
  },
  "download": "/files/popl265-foster.pdf",
  "abstract": "<p>NetKAT is a domain-specific language and logic for specifying and verifying network packet-processing functions. It consists of Kleene algebra with tests (KAT) augmented with primitives for testing and modifying packet headers and encoding network topologies. Previous work developed the design of the language and its standard semantics, proved the soundness and completeness of the logic, defined a PSPACE algorithm for deciding equivalence, and presented several practical applications.</p><p>This paper develops the coalgebraic theory of NetKAT, including a specialized version of the Brzozowski derivative, and presents a new efficient algorithm for deciding the equational theory using bisimulation. The coalgebraic structure admits an efficient sparse representation that results in a significant reduction in the size of the state space. We discuss the details of our implementation and optimizations that exploit NetKAT's equational axioms and coalgebraic structure to yield significantly improved performance. We present results from experiments demonstrating that our tool is competitive with state-of-the-art tools on several benchmarks including all-pairs connectivity, loop-freedom, and translation validation.</p>"

},{
  "year": 2015,
  "id": "KMPS15",
  "authors": ["Konstantinos Mamouras", "Dexter Kozen", "Daniela Petrisan", "Alexandra Silva"],
  "title": "Nominal Kleene Coalgebra",
  "techreport": {
    "type": "Technical Report",
    "number": "1813/39108",
    "institution": "Cornell University"
  },
  "download": "http://hdl.handle.net/1813/39108",
  "abstract": "<p>We develop the coalgebraic theory of nominal Kleene algebra, including an alternative language-theoretic semantics, a nominal extension of the Brzozowski derivative, and a bisimulation-based decision procedure for the equational theory.</p>"

 },
 {
 "year": 2015,
 "id": "JSS15",
 "authors": ["Bart Jacobs", "Alexandra Silva", "Ana Sokolova"],
 "title": "Trace Semantics via Determinization",
 "journal": {
 "name": "Journal of Computer and System Sciences",
 "volume":  81,
 "number" : 5,
 "pages" : "859-879",
 "note": "This is an extended version of our homonimous CMCS 2012 paper (see below)."
 },
 "download": "/files/determinization-journal.pdf",
 "abstract": "<p>This paper takes a fresh look at the topic of trace semantics in the theory of coalgebras. In the last few years, two approaches, somewhat incomparable at first sight, captured successfully in a coalgebraic setting trace semantics for various types of transition systems. The first development of coalgebraic trace semantics used final coalgebras in Kleisli categories and required some non-trivial assumptions, which do not always hold, even in cases where one can reasonably speak of traces (like for weighted automata). The second development stemmed from the observation that trace semantics can also arise by performing a determinization construction and used final coalgebras in Eilenberg-Moore categories. In this paper, we develop a systematic study in which the two approaches can be studied and compared. Notably, we show that the two different views on trace semantics are equivalent, in the examples where both approaches are applicable.</p>"
 
  }, {
  "year": 2015,
  "id": "RBBPRS15",
  "authors": ["Jurriaan Rot", "Filippo Bonchi", "Marcello Bonsangue", "Damien Pous", "Jan Rutten", "Alexandra Silva"],
  "title": "Enhanced Coalgebraic Bisimulation",
  "journal": {
  "name": "Mathematical Structures in Computer Science"
  },
  "download": "/files/up-to.pdf",
  "abstract": "<p>Theoretical models of recursion schemes have been well studied under the names well-founded coalgebras, recursive coalgebras, corecursive algebras, and Elgot algebras. Much of this work focuses on conditions ensuring unique or canonical solutions, e.g. when the coalgebra is well-founded. If the coalgebra is not well-founded, then there can be multiple solutions. The standard semantics of recursive programs gives a particular solution, namely the least solution in a flat Scott domain, which may not be the desired one. We have recently proposed programming language constructs to allow the specification of alternative solutions and methods to compute them. We have implemented these new constructs as an extension of OCaml. In this paper, we prove some theoretical results characterizing well-founded coalgebras that slightly extend results of Adamek, Luecke, and Milius (2007), along with several examples for which this extension is useful. We also give several examples that are not well-founded but still have a desired solution. In each case, the function would diverge under the standard semantics of recursion, but can be specified and computed with the programming language constructs we have proposed.</p>"
  
  },
 {
 "year": 2015,
 "id": "CLSS14",
 "authors": ["Marco Carbone", "Ivan Lanese", "Alexandra Silva", "Ana Sokolova"],
 "title": "Special issue with selected contributions of the 5th Interaction and Concurrency Experience.",
 "edited": {
 "publisher": "Elsevier",
 "series": "Science of Computer Programming",
 "volume": 100
 }
 },
 {
 "year": 2015,
 "id": "OSB15",
 "authors": ["Nuno Oliveira", "Alexandra Silva", "Luís Barbosa"],
 "title": "IMC-Reo: Interactive Markov Chains for stochastic Reo.",
 "journal": {
 "name": "Journal of Internet Services and Information Security",
 "volume" : 5,
 "number" : 1,
 "pages" : "3-28",
 "note": "This is an extended version of our ACM SAC 2014 paper (see below)."
 },
 "download": "/files/jisisOSB_final.pdf",
 "abstract": "<p>The study of composed software and its properties is in itself a great challenge. Bringing quantitative aspects into the picture increases the complexity of the analysis and entails the need for reconciling both the classical and the stochastic analyses. The quest herein is to provide constructs for composition of building blocks and semantic models thereof which enable both analyses and allow for modeling and verification.</p><p>Stochastic Reo offers constructs for component and service coordination and provides means for specification of stochastic values for software connectors. Interactive Markov chains (IMC) on the other hand, are a stochastic, compositional, extension of classical models of concurrency, integrating classical and stochastic aspects.</p><p>This paper discusses how IMC can be effectively used as a compositional semantic model for Stochastic Reo, avoiding to resort to a separate automaton model, often lacking full compositionality, as intermediate semantics. A tool chain integrating available tool support for IMC, is described and applied in the analysis of a case study dealing with performance and resource allocation of a mediation system.</p>"
 
 },
 {
  "year": 2014,
  "id": "MGS14",
  "authors": ["Stefan Milius", "Sergey Goncharov", "Alexandra Silva"],
  "title": "Towards a Coalgebraic Chomsky Hierarchy",
  "conference": {
    "name": "Theoretical Computer Science -- 8th IFIP TC 1/WG 2.2 International Conference",
    "location": "Rome, Italy",
    "url": "http://www.easyconferences.eu/tcs2014",
    "series": "LNCS",
    "volume": 8705,
    "pages": "265-280"
  },
  "download": "http://arxiv.org/pdf/1401.5277v3.pdf",
  "abstract": "<p>The Chomsky hierarchy plays a prominent role in the foundations of the theoretical computer science relating classes of formal languages of primary importance. In this paper we use recent developments on coalgebraic and monad-based semantics to obtain a generic notion of a T-automaton, where T is a monad, which allows the uniform study of various notions of machines (e.g. finite state machines, multi-stack machines, Turing machines, valence automata, weighted automata). We use the generalized powerset construction to define a generic (trace) semantics for T-automata, and we show by numerous examples that it correctly instantiates for the known classes of machines/languages captured by the Chomsky hierarchy. Moreover, our approach provides new generic techniques for proving expressivity bounds of various machine-based models.</p>"

},  {
  "year": 2014,
  "id": "JSS14b",
  "authors": ["Bart Jacobs", "Alexandra Silva", "Sam Staton"],
  "title": "Proceedings of the 30th conference on Mathematical Foundations of Programming Semantics.",
  "edited": {
    "publisher": "Elsevier",
    "series": "Electronic Notes in Theoretical Computer Science",
    "volume": 308,
    "pages": "1-2",
    "url": "http://www.sciencedirect.com/science/article/pii/S1571066114000681"
  }
}, {
  "year": 2014,
  "id": "JS14b",
  "authors": ["Bart Jacobs", "Alexandra Silva"],
  "title": "Automata learning: a categorical perspective.",
  "conference": {
    "name": "Horizons of the Mind. A Tribute to Prakash Panangaden.",
    "location": "Oxford, United Kingdom",
    "url": "http://www.cs.ox.ac.uk/pf2014",
    "series": "LNCS",
    "volume": 8464,
    "pages": "384-406"
  },
  "download": "/files/prakash.pdf",
  "abstract": "Automata learning is a known technique to infer a finite state machine from a set of observations. In this paper, we revisit Angluin’s original algorithm from a categorical perspective. This abstract view on the main ingredients of the algorithm lays a uniform framework to derive algorithms for other types of automata. We show a straightforward generalization to Moore and Mealy machines, which yields an algorithm already know in the literature, and we discuss generalizations to other types of automata, including weighted automata."

},
 {
  "year": 2014,
  "id": "BMSZ14",
  "authors": ["Filippo Bonchi", "Stefan Milius", "Alexandra Silva", "Fabio Zanasi"],
  "title": "How to Kill Epsilons with a Dagger -- A Coalgebraic Take on Systems with Algebraic Label Structure",
  "conference": {
    "name": "12th International Workshop on Coalgebraic Methods in Computer Science",
    "location": "Grenoble, France",
    "url": "http://www.coalg.org/cmcs14",
    "series": "LNCS",
    "volume": 8446,
    "pages": "53-74"
  },
  "download": "http://arxiv.org/pdf/1402.4062v2.pdf",
  "abstract": "<p>We propose an abstract framework for modeling state-based systems with internal behavior as e.g. given by silent or ǫ-transitions. Our approach employs monads with a parametrized fixpoint operator † to give a semantics to those systems and implement a sound procedure of abstraction of the internal transitions, whose labels are seen as the unit of a free monoid. More broadly, our approach extends the standard coalgebraic framework for state-based systems by taking into account the algebraic structure of the labels of their transitions. This allows to consider a wide range of other examples, including Mazurkiewicz traces for concurrent systems.</p>"

}, {
  "year": 2014,
  "id": "OSB14",
  "authors": ["Nuno Oliveira", "Alexandra Silva", "Luís Barbosa"],
  "title": "Quantitative Analysis of Reo-based Service Coordination",
  "conference": {
    "name": "29th Annual ACM Symposium on Applied Computing",
    "abbreviation": "ACM SAC",
    "location": "Gyeongju, Korea",
    "url": "http://www.acm.org/conferences/sac/sac2014",
    "series": "ACM Press",
    "volume": 2,
    "pages": "1247-1254"
  },
  "download": "/files/imcreoOSB.pdf",
  "abstract": "<p>Quality of Service analysis of composed software systems is an active research area, with the goal of evaluating and improving performance and resource allocation in serviceoriented applications, namely, in the glue code--coordination layer--of such systems. Stochastic Reo offers constructs for service coordination and allows the specification of stochastic values for channels. But its state-of-the-art semantic models fail in several (important) ways. In this paper, we will see how Interactive Markov chains (IMC), proposed as a stochastic compositional model of concurrency, can be effectively used to serve as a compositional semantic model for Stochastic Reo. Treating IMC as a direct semantic model, gives rise to more faithful models and has obvious efficiency advantages. Moreover, tool support that exists for IMC is made available, without significant effort, to verify and reason about the coordination layer modelled as Reo connectors.</p>"

}, {
  "year": 2014,
  "id": "FKMST14-tr",
  "authors": ["Nate Foster", "Dexter Kozen", "Matthew Milano", "Alexandra Silva", "Laure Thompson"],
  "title": " A coalgebraic decision procedure for NetKAT.",
  "techreport": {
    "number": "1813/36255",
    "institution": "Cornell University"
  },
  "abstract": "<p>Program equivalence is a fundamental problem that has practical applications across a variety of areas of computing including compilation, optimization, software synthesis, formal verification, and many others. Equivalence is undecidable in general, but in certain settings it is possible to develop domain-specific languages that are expressive enough to be practical and yet sufficiently restricted so that equivalence remains decidable. In previous work we introduced NetKAT, a domain-specific language for specifying and verifying network packet-processing functions. NetKAT provides familiar constructs such as tests, assignments, union, sequential composition, and iteration as well as custom primitives for modifying packet headers and encoding network topologies. Semantically, NetKAT is based on Kleene algebra with tests (KAT) and comes equipped with a sound and complete equational theory. Although NetKAT equivalence is decidable, the best known algorithm is hardly practical-it uses Savitch's theorem to determinize a PSPACE algorithm and requires quadratic space. This paper presents a new algorithm for deciding NetKAT equivalence. This algorithm is based on finding bisimulations between finite automata constructed from NetKAT programs. We investigate the coalgebraic theory of NetKAT, generalize the notion of Brzozowski derivatives to NetKAT, develop efficient representations of NetKAT automata in terms of spines and sparse matrices, and discuss the highlights of our prototype implementation.</p>"

}, {
  "year": 2014,
  "id": "MSKA14",
  "authors": ["Young-Joo Moon", "Alexandra Silva", "Christian Krause", "Farhad Arbab"],
  "title": "A compositional model to reason about end-to-end QoS in Stochastic Reo connectors",
  "journal": {
    "name": "Science of Computer Programming",
    "volume": 80,
    "pages": "3-24",
    "note": "A previous version of this paper appeared as CWI technical report SEN-1007 (see below)"
  },
  "download": "http://www.sciencedirect.com/science/article/pii/S0167642311002073?via=ihub",
  "abstract": "<p>In this paper we present a compositional semantics for the channel-based coordination language Reo which enables the analysis of quality of service (QoS) properties of service compositions. For this purpose, we annotate Reo channels with stochastic delay rates and explicitly model data-arrival rates at the boundary of a connector, to capture its interaction with the services that comprise its environment. We propose Stochastic Reo automata as an extension of Reo automata, in order to compositionally derive a QoS-aware semantics for Reo. We further present a translation of Stochastic Reo automata to Continuous-Time Markov Chains (CTMCs). This translation enables us to use third- party CTMC verification tools to do an end-to-end performance analysis of service compositions.</p>"

}, {
  "year": 2014,
  "id": "BBHPRS14",
  "authors": ["Filippo Bonchi", "Marcello Bonsangue", "Helle Hansen", "Prakash Panangaden", "Jan Rutten", "Alexandra Silva"],
  "title": "Algebra-Coalgebra Duality in Brzozowski's Minimization Algorithm.",
  "journal": {
    "name": "ACM Transactions on Computational Logic (TOCL)",
    "volume": 15,
    "number": 1
  },
  "download": "http://arxiv.org/pdf/1302.1046v2",
  "abstract": "<p>We give a new presentation of Brzozowski’s algorithm to minimize finite automata, using elementary facts from universal algebra and coalgebra, and building on earlier work by Arbib and Manes on a categorical presentation of Kalman duality between reachability and observability. This leads to a simple proof of its correctness and opens the door to further generalizations. Notably, we derive algorithms to obtain minimal, language equivalent automata from Moore, non-deterministic and weighted automata.</p>"

}, {
  "year": 2014,
  "id": "JKS14",
  "authors": ["Jean-Baptiste Jeannin", "Dexter Kozen", "Alexandra Silva"],
  "title": "Well-Founded Coalgebras, Revisited",
  "journal": {
    "name": "Mathematical Structures in Computer Science",
    "note": "A previous version of this paper appeared as a Cornell tech report (see below)"
  },
  "download": "/files/theory.pdf",
  "abstract": "<p>Theoretical models of recursion schemes have been well studied under the names well-founded coalgebras, recursive coalgebras, corecursive algebras, and Elgot algebras. Much of this work focuses on conditions ensuring unique or canonical solutions, e.g. when the coalgebra is well-founded. If the coalgebra is not well-founded, then there can be multiple solutions. The standard semantics of recursive programs gives a particular solution, namely the least solution in a flat Scott domain, which may not be the desired one. We have recently proposed programming language constructs to allow the specification of alternative solutions and methods to compute them. We have implemented these new constructs as an extension of OCaml. In this paper, we prove some theoretical results characterizing well-founded coalgebras that slightly extend results of Adamek, Luecke, and Milius (2007), along with several examples for which this extension is useful. We also give several examples that are not well-founded but still have a desired solution. In each case, the function would diverge under the standard semantics of recursion, but can be specified and computed with the programming language constructs we have proposed.</p>"

}, {
  "year": 2014,
  "id": "KS14",
  "authors": ["Dexter Kozen", "Alexandra Silva"],
  "title": "Practical Coinduction",
  "journal": {
    "name": "Mathematical Structures in Computer Science",
    "note": "A previous version of this paper appeared as a Cornell tech report (see below)"
  },
  "download": "/files/Structural.pdf",
  "abstract": "<p>Induction is a well-established proof principle that is taught in most undergraduate programs in mathematics and computer science. In computer science, it is used primarily to reason about inductively-defined datatypes such as finite lists, finite trees, and the natural numbers. Coinduction is the dual principle that can be used to reason about coinductive datatypes such as infinite streams or trees, but it is not as widespread or as well understood. In this paper, we illustrate through several examples the use of coinduction in informal mathematical arguments. Our aim is to promote the principle as a useful tool for the working mathematician and to bring it to a level of familiarity on par with induction. We show that coinduction is not only about bisimilarity and equality of behaviors, but also applicable to a variety of functions and relations defined on coinductive datatypes.</p>"

}, {
  "year": 2014,
  "id": "JS14",
  "authors": ["Bart Jacobs", "Alexandra Silva"],
  "title": "Initial Algebras of Terms, with binding and algebraic structure",
  "abstract": "<p>One of the many results which makes Joachim Lambek famous is: an initial algebra of an endofunctor is an isomorphism. This fixed point result is often referred to as ``Lambek's Lemma''. In this paper, we illustrate the power of initiality by exploiting it in categories of algebra-valued presheaves $\\EM(T)^{\\N}$, for a monad $T$ on $\\Sets$.</p><p>The use of presheaves to obtain certain calculi of expressions (with variable binding) was introduced by Fiore, Plotkin, and Turi. They used set-valued presheaves, whereas here the presheaves take values in a category $\\EM(T)$ of Eilenberg-Moore algebras. This generalisation allows us to develop a theory where more structured calculi can be obtained. The use of algebras means also that we work in a linear context and need a separate operation $\\bang$ for replication, for instance to describe strength for an endofunctor on $\\EM(T)$. We apply the resulting theory to give systematic descriptions of non-trivial calculi: we introduce non-deterministic and weighted lambda terms and expressions for automata as initial algebras, and we formalise relevant equations diagrammatically.</p>",
  "conference": {
    "name": "Categories and Types in Logic, Language and Physics. Festschrift on the occasion of Jim Lambek's 90th birthday",
    "location": "Montreal, Canada",
    "url": "http://www.crm.umontreal.ca/2013/Lambek13//index_e.php",
    "series": "LNCS",
    "volume": 8222,
    "pages": "211-234"
  }
}, {
  "year": 2013,
  "id": "BCPS13",
  "authors": ["Filippo Bonchi", "Georgiana Caltais", "Damien Pous", "Alexandra Silva"],
  "title": "Brzozowski's and Up-To Algorithms for Must Testing",
  "conference": {
    "name": "11th Asian Symposium on Programming Languages and Systems (APLAS 2013)",
    "location": "Melbourne, VIC, Australia",
    "url": "http://aplas2013.soic.indiana.edu",
    "series": "LNCS",
    "volume": "8301",
    "pages": "1-16"
  },
  "download": "/files/aplas2013.pdf",
  "abstract": "<p>Checking language equivalence (or inclusion) of finite automata is a classical problem in Computer Science, which has recently received a renewed interest and found novel and more effective solutions, such as approaches based on antichains or bisimulations up-to. Several notions of equivalence (or preorder) have been proposed for the analysis of concurrent systems. Usually, the problem of checking these equivalences is reduced to checking bisimilarity. In this paper, we take a different approach and propose to adapt algorithms for language equivalence to check one prime equivalence in concurrency theory, must testing semantics. To achieve this transfer of technology from language to must semantics, we take a coalgebraic outlook at the problem.</p>"

}, {
  "year": 2013,
  "id": "SW13",
  "authors": ["Alexandra Silva", "Bram Westerbaan"],
  "title": "A coalgebraic view of epsilon-transitions.",
  "conference": {
    "name": "CALCO 2013",
    "location": "Warsaw, Poland",
    "url": "http://www.coalg.org/calco13",
    "series": "LNCS",
    "volume": "8089",
    "pages": "267-282"
  },
  "download": "/files/epsilon-extended.pdf",
  "abstract": "<p>In automata theory, a machine transitions from one state to the next when it reads an input symbol. It is common to also allow an automaton to transition without input, via an epsilon-transition. These epsilon-transitions are convenient, e.g., when one defines the composition of automata. However, they are not necessary, and can be eliminated. Such epsilon-elimination procedures have been studied separately for different types of automata, including non-deterministic and weighted automata. It has been noted by Hasuo that it is possible to give a coalgebraic account of epsilon-elimination for some automata using trace semantics (as defined by Hasuo, Jacobs and Sokolova).</p><p>In this paper, we give a detailed description of the epsilon-elimination procedure via trace semantics (missing in the literature). We apply this framework to several types of automata, and explore its boundary. In particular, we show that is possible (by careful choice of a monad) to define an epsilon-removal procedure for all weighted automata over the positive reals (and certain other semirings). Our definition extends the recent proposals by Sakarovitch and Lombardy for these semirings.</p>"

}, {
  "year": 2013,
  "id": "SS13",
  "authors": ["Alexandra Silva", "Pawel Sobocinski"],
  "title": "Report on CALCO 2013.",
  "journal": {
    "name": "Bulletin of the EATCS",
    "volume": "111"
  },
  "download": "http://eatcs.org/beatcs/index.php/beatcs/article/view/195",
  "abstract": "<p>Calco 2013, the 5th International conference on Algebra and Coalgebra in Computer Science, took place in Warsaw, Poland, 2nd - 6th September 2013, in the beautiful setting of the Old Library building on the historical campus of the University of Warsaw.</p>"

}, {
  "year": 2013,
  "id": "JKS13b",
  "authors": ["Jean-Baptiste Jeannin", "Dexter Kozen", "Alexandra Silva"],
  "title": "Well-Founded Coalgebras, Revisited",
  "techreport": {
    "type": "Technical Report",
    "number": "1813/33330",
    "institution": "Cornell University"
  },
  "download": "http://ecommons.library.cornell.edu/handle/1813/33330",
  "abstract": "<p>Theoretical models of recursion schemes have been well studied under the names well-founded coalgebras, recursive coalgebras, corecursive algebras, and Elgot algebras. Much of this work focuses on conditions ensuring unique or canonical solutions, e.g. when the coalgebra is well-founded. If the coalgebra is not well-founded, then there can be multiple solutions. The standard semantics of recursive programs gives a particular solution, namely the least solution in a flat Scott domain, which may not be the desired one. We have recently proposed programming language constructs to allow the specification of alternative solutions and methods to compute them. We have implemented these new constructs as an extension of OCaml. In this paper, we prove some theoretical results characterizing well-founded coalgebras that slightly extend results of Adamek, Luecke, and Milius (2007), along with several examples for which this extension is useful. We also give several examples that are not well-founded but still have a desired solution. In each case, the function would diverge under the standard semantics of recursion, but can be specified and computed with the programming language constructs we have proposed.</p>"

}, {
  "year": 2013,
  "id": "SBBR13",
  "authors": ["Alexandra Silva", "Filippo Bonchi", "Marcello Bonsangue", "Jan Rutten"],
  "title": " Generalizing determinization from automata to coalgebras.",
  "journal": {
    "name": "Logical Methods in Computer Science",
    "volume": "9",
    "number": "1"
  },
  "download": "http://arxiv.org/pdf/1302.1046v2 http://www.lmcs-online.org/ojs/viewarticle.php?id=1091",
  "abstract": "<p>The powerset construction is a standard method for converting a nondeterministic automaton into a deterministic one recognizing the same language. In this paper, we lift the powerset construction from automata to the more general framework of coalgebras with structured state spaces. Coalgebra is an abstract framework for the uniform study of different kinds of dynamical systems. An endofunctor F determines both the type of systems (F-coalgebras) and a notion of behavioural equivalence ($\\sim_F$) amongst them. Many types of transition systems and their equivalences can be captured by a functor F. For example, for deterministic automata the derived equivalence is language equivalence, while for non-deterministic automata it is ordinary bisimilarity. We give several examples of applications of our generalized determinization construction, including partial Mealy machines, (structured) Moore automata, Rabin probabilistic automata, and, somewhat surprisingly, even pushdown automata. To further witness the generality of the approach we show how to characterize coalgebraically several equivalences which have been object of interest in the concurrency community, such as failure or ready semantics.</p>"

}, {
  "year": 2013,
  "id": "JKS13",
  "authors": ["Jean-Baptiste Jeannin", "Dexter Kozen", "Alexandra Silva"],
  "title": "Language Constructs for Non-Well-Founded Computations",
  "conference": {
    "name": "22nd European Symposium on Programming, ESOP 2013",
    "location": "Rome, Italy",
    "url": "http://www.etaps.org/2013/esop13",
    "series": "LNCS",
    "volume": "7792",
    "pages": "61-80",
    "note": "An earlier version of this paper appeared as Cornell Technical report (see below)"
  },
  "download": "http://dx.doi.org/10.1007/978-3-642-37036-6_4",
  "abstract": "<p>Recursive functions defined on a coalgebraic datatype C may not converge if there are cycles in the input, that is, if the input object is not well-founded. Even so, there is often a useful solution. Unfortunately, current functional programming languages provide no support for specifying alternative solution methods. In this paper we give numerous examples in which it would be useful to do so: free variables, alpha-conversion, and substitution in infinitary lambda-terms; halting probabilities and expected running times of probabilistic protocols; abstract interpretation; and constructions involving finite automata. In each case the function would diverge under the standard semantics of recursion. We propose programming language constructs that would allow the specification of alternative solutions and methods to compute them.</p>"

}, {
  "year": 2013,
  "id": "BCGLRS13",
  "authors": ["Marcello Bonsangue", "Georgiana Caltais", "Eugen Goriac", "Dorel Lucanu", "Jan Rutten", "Alexandra Silva"],
  "title": "Automatic Equivalence Proofs for Non-deterministic Coalgebras.",
  "journal": {
    "name": "Science of Computer Programming",
    "volume": "78",
    "number": "9",
    "pages": "1324-1345",
    "note": "A previous version of this paper appeared as CWI technical report SEN-1109 (see below)"
  },
  "download": "http://arxiv.org/pdf/1303.1994v2.pdf",
  "abstract": "<p>A notion of generalized regular expressions for a large class of systems modeled as coalgebras, and an analogue of Kleene's theorem and Kleene algebra, were recently proposed by a subset of the authors of this paper. Examples of the systems covered include infinite streams, deterministic automata, Mealy machines and labelled transition systems. In this paper, we present a novel algorithm to decide whether two expressions are bisimilar or not. The procedure is implemented in the automatic theorem prover CIRC, by reducing coinduction to an entailment relation between an algebraic specification and an appropriate set of equations. We illustrate the generality of the tool with three examples: infinite streams of real numbers, Mealy machines and labelled transition systems.</p>"

}, {
  "year": 2013,
  "id": "BMS13",
  "authors": ["Marcello Bonsangue", "Stefan Milius", "Alexandra Silva"],
  "title": "Sound and complete axiomatizations of coalgebraic language equivalence",
  "journal": {
    "name": "ACM Transactions on Computational Logic (TOCL)",
    "volume": "14",
    "number": "1"
  },
  "download": "http://dl.acm.org/citation.cfm?doid=2422085.2422092 http://arxiv.org/abs/1104.2803",
  "abstract": "<p>Coalgebras provide a uniform framework for studying dynamical systems, including several types of automata. In this article, we make use of the coalgebraic view on systems to investigate, in a uniform way, under which conditions calculi that are sound and complete with respect to behavioral equivalence can be extended to a coarser coalgebraic language equivalence, which arises from a generalized powerset construction that determinizes coalgebras. We show that soundness and completeness are established by proving that expressions modulo axioms of a calculus form the rational fixpoint of the given type functor. Our main result is that the rational fixpoint of the functor FT, where T is a monad describing the branching of the systems (e.g., non-determinism, weights, probability, etc.), has as a quotient the rational fixpoint of the determinized type functor F, a lifting of F to the category of T-algebras. We apply our framework to the concrete example of weighted automata, for which we present a new sound and complete calculus for weighted language equivalence. As a special case, we obtain nondeterministic automata in which we recover Rabinovich’s sound and complete calculus for language equivalence.</p>"

}, {
  "year": 2013,
  "id": "KS13",
  "authors": ["Dexter Kozen", "Alexandra Silva"],
  "title": "On Moessner's theorem",
  "journal": {
    "name": "American Mathematical Monthly",
    "volume": "120",
    "number": "2",
    "pages": "131-139"
  },
  "download": "http://www.jstor.org/stable/10.4169/amer.math.monthly.120.02.131",
  "abstract": "<p>Moessner's theorem describes a procedure for generating a sequence of n integer sequences that lead unexpectedly to the sequence of nth powers 1n, 2n, 3n, ... Paasche's theorem is a generalization of Moessner's; by varying the parameters of the procedure, one can obtain the sequence of factorials 1!, 2!, 3!, ... or the sequence of superfactorials 1!!, 2!!, 3!!, ... Long's theorem generalizes Moessner's in another direction, providing a procedure to generate the sequence a1n-1, (a+d)2n-1, (a+2d)3n-1, ... Proofs of these results in the literature are typically based on combinatorics of binomial coefficients or calculational scans.  In this note we give a short and revealing algebraic proof of a general theorem that contains Moessner's, Paasche's, and Long's as special cases.  We also prove a generalization that gives new Moessner-type theorems</p>"

}, {
  "year": 2013,
  "id": "EHHPS13",
  "authors": ["Joerg Endrullis", "Helle Hansen", "Dimitri Hendriks", "Andrew Polonsky", "Alexandra Silva"],
  "title": "A Coinductive Treatment of Infinitary Rewriting",
  "journal": {
    "name": "CoRR",
    "volume": "abs/1306.6224",
    "note": "Draft"
  },
  "download": "http://arxiv.org/pdf/1306.6224v1.pdf",
  "abstract": "<p>We introduce a coinductive definition of infinitary term rewriting. The setup is surprisingly simple, and has in contrast to the usual definitions of infinitary rewriting, neither need for ordinals nor for metric convergence. While the idea of a coinductive treatment of infinitary rewriting is not new, all previous approaches were limited to reductions of length at most omega. The approach presented in this paper is the first to capture the full infinitary term rewriting with reductions of arbitrary ordinal length. Apart from an elegant reformulation of known concepts, our approach gives rise, in a very natural way, to a novel notion of infinitary equational reasoning.irst sound and complete calculus for weighted language equivalence.</p>"

}, {
  "year": 2012,
  "id": "JKS12b",
  "authors": ["Jean-Baptiste Jeannin", "Dexter Kozen", "Alexandra Silva"],
  "title": "CoCaml: Programming with Coinductive Types",
  "techreport": {
    "type": "Technical Report",
    "number": "1813/30798",
    "institution": "Cornell University"
  },
  "download": "http://hdl.handle.net/1813/30798",
  "abstract": "<p>We present CoCaml, a functional programming language extending OCaml, which allows us to define functions on coinductive datatypes parameterized by an equation solver. We provide numerous examples that attest to the usefulness of the new programming constructs, including operations on infinite lists, infinitary lambda-terms and p-adic numbers.</p>"

}, {
  "year": 2012,
  "id": "KS12b",
  "authors": ["Dexter Kozen", "Alexandra Silva"],
  "title": "Practical Coinduction",
  "techreport": {
    "type": "Technical Report",
    "number": "1813/30510",
    "institution": "Cornell University"
  },
  "download": "http://hdl.handle.net/1813/30510",
  "abstract": "<p>Induction is a well-established proof principle that is taught in most undergraduate programs in mathematics and computer science. In computer science, it is used primarily to reason about inductively-defined datatypes such as finite lists, finite trees, and the natural numbers. Coinduction is the dual principle that can be used to reason about coinductive datatypes such as infinite streams or trees, but it is not as widespread or as well understood. In this paper, we illustrate through several examples the use of coinduction in informal mathematical arguments. Our aim is to promote the principle as a useful tool for the working mathematician and to bring it to a level of familiarity on par with induction. We show that coinduction is not only about bisimilarity and equality of behaviors, but also applicable to a variety of functions and relations defined on coinductive datatypes.</p>"

}, {
  "year": 2012,
  "id": "S12",
  "authors": ["Alexandra Silva"],
  "title": "Position automata for Kleene algebra with tests",
  "journal": {
    "name": "Scientific Annals of Computer Science",
    "volume": "22",
    "number": "2",
    "pages": "367-394"
  },
  "abstract": "<p>Kleene algebra with tests (KAT) is an equational system that combines Kleene and Boolean algebras. One can model basic programming constructs and assertions in KAT, which allowed for its application in compiler optimization, program transformation and dataflow analysis. To provide semantics for KAT expressions, Kozen first introduced automata on guarded strings, showing that the regular sets of guarded strings plays the same role in KAT as regular languages play in Kleene algebra. Recently, Kozen described an elegant algorithm, based on ``derivatives'',  to construct a deterministic automaton that accepts the guarded strings denoted by a KAT expression. This algorithm generalizes Brzozowski's algorithm for regular expressions and inherits its inefficiency arising from the explicit computation of derivatives. In the context of classical regular expressions, many efficient algorithms to compile expressions to automata have been proposed. One of those algorithms was devised by Berry and Sethi in the 80's (we shall refer to it as Berry-Sethi construction/algorithm, but in the literature it is also referred to as position or Glushkov automata algorithm).</p><p>In this paper, we show how the Berry-Sethi algorithm can be used to compile a KAT expression to an automaton on guarded strings. Moreover, we  propose a new automata model for KAT expressions and adapt the construction of Berry and Sethi to this new model.</p>"

}, {
  "year": 2012,
  "id": "JKS12",
  "authors": ["Jean-Baptiste Jeannin", "Dexter Kozen", "Alexandra Silva"],
  "title": " Language constructs for non-well-founded computation.",
  "techreport": {
    "type": "CWI technical report",
    "number": "SEN 12-02",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://www.cs.cornell.edu/~kozen/papers/nwf.pdf",
  "abstract": "<p>Recursive functions defined on a coalgebraic datatype may not converge if there are cycles in the input, that is, if the input object is not well-founded. Even so, there is often a useful solution; for example, the free variables of an infinitary lambda-term, or the expected running time of a finite-state probabilistic protocol. Theoretical models of recursion schemes have been well studied under the names well-founded coalgebras, recursive coalgebras, corecursive algebras, and Elgot algebras. Much of this work focuses on conditions ensuring unique or canonical solutions, e.g. when the domain is well-founded. If the domain is not well-founded, there can be multiple solutions. The standard semantics of recursive programs gives a particular solution, namely the least solution in a flat Scott domain, which may not be the one we want. Unfortunately, current programming languages provide no support for specifying alternatives. In this paper we give numerous examples in which it would be useful to do so and propose programming language constructs that would allow the specification of alternative solutions and methods to compute them. The programmer must essentially provide a way to solve equations in the codomain. We show how to implement these new constructs as an extension of existing languages. We also prove some theoretical results characterizing well-founded coalgebras that slightly extend results of Adamek, Luecke, and Milius (2007).</p>"

}, {
  "year": 2012,
  "id": "BBCS12",
  "authors": ["Simon Bliudze", "Roberto Bruni", "Marco Carbone", "Alexandra Silva"],
  "title": "Towards Interaction Reliability in Concurrent Applications.",
  "edited": {
    "publisher": "University of Iasi",
    "series": "Scientific Annals of Computer Science",
    "volume": 22
  },
  "download": "http://dx.doi.org/10.7561/SACS.2012.1.1"

}, {
  "year": 2012,
  "id": "KS12",
  "authors": ["Dexter Kozen", "Alexandra Silva"],
  "title": "Left-handed completeness",
  "conference": {
    "name": "13th International Conference on Relational and Algebraic Methods in Computer Science ",
    "location": "Cambridge, UK",
    "url": "http://www.cl.cam.ac.uk/conference/ramics13/",
    "series": "LNCS",
    "volume": "7560",
    "pages": "162-178",
    "note": "An earlier version of this paper appeared as Cornell Technical report (see below)"
  },
  "download": "/files/Left.pdf",
  "abstract": "<p>We give a new, significantly shorter proof of the completeness of the left-handed star rule of Kleene algebra. The proof reveals the rich interaction of algebra and coalgebra in the theory.</p>"

}, {
  "year": 2012,
  "id": "CLSS12",
  "authors": ["Marco Carbone", "Ivan Lanese", "Alexandra Silva", "Ana Sokolova"],
  "title": "Proceedings ICE 2012",
  "edited": {
    "publisher": "ArXiv",
    "series": "EPTCS",
    "volume": 104
  },
  "download": "http://dx.doi.org/10.4204/EPTCS.104"

}, {
  "year": 2012,
  "id": "BBRS12",
  "authors": ["Filippo Bonchi", "Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": "Brzozowski's Algorithm (Co)Algebraically",
  "conference": {
    "name": "Logic and Program Semantics - Essays Dedicated to Dexter Kozen on the Occasion of His 60th Birthday",
    "location": "Ithaca, NY, USA",
    "url": "http://www.cs.cornell.edu/Events/Dexter60/",
    "series": "LNCS",
    "volume": "7230",
    "pages": "12-23",
    "note": "An earlier version of this paper appeared as CWI tech report SEN 11-14 (see below)"
  },
  "download": "/files/RechabilityObservability.pdf",
  "abstract": "<p>We give a new presentation of Brzozowski’s algorithm to minimize finite automata, using elementary facts from universal algebra and coalgebra, and building on earlier work by Arbib and Manes on the duality between reachability and observability. This leads to a simple proof of its correctness and opens the door to further generalizations.</p>"

}, {
  "year": 2012,
  "id": "CS12",
  "authors": ["Robert L. Constable", "Alexandra Silva"],
  "edited": {
    "publisher": "Springer",
    "series": "LNCS",
    "volume": 7230
  },
  "download": "http://www.springerlink.com/content/q467lv156412/?MUD=MP",
  "title": "Logic and Program Semantics - Essays Dedicated to Dexter Kozen on the Occasion of His 60th Birthday"

}, {
  "year": 2012,
  "id": "BBBBRS12",
  "authors": ["Filippo Bonchi", "Marcello Bonsangue", "Michele Boreale", "Jan Rutten", "Alexandra Silva"],
  "title": "A coalgebraic perspective on linear weighted automata",
  "journal": {
    "name": "Information and Computation",
    "volume": "211",
    "pages": "77-105"
  },
  "download": "/files/ic-lwa.pdf",
  "abstract": "<p>Weighted automata are a generalisation of non-deterministic automata where each transition, in addition to an input letter, has also a quantity expressing the weight (e.g. cost or probability) of its execution. As for non-deterministic automata, their behaviours can be expressed in terms of either (weighted) bisimilarity or (weighted) language equivalence.</p><p>Coalgebras provide a categorical framework for the uniform study of state-based systems and their behaviours. In this work, we show that coalgebras can suitably model weighted automata in two different ways: coalgebras on Set (the category of sets and functions) characterise weighted bisimilarity, while coalgebras on Vect (the category of vector spaces and linear maps) characterise weighted language equivalence.</p><p>Relying on the second characterisation, we show three different procedures for computing weighted language equivalence. The first one consists in a generalisation of the usual partition refinement algorithm for ordinary automata. The second one is the backward version of the first one. The third procedure relies on a syntactic representation of rational weighted languages.</p>"

}, {
  "year": 2012,
  "id": "JSS12",
  "authors": ["Bart Jacobs", "Alexandra Silva", "Ana Sokolova"],
  "title": "Trace Semantics via Determinization",
  "conference": {
    "name": "Proceedings of the 11th International Workshop on Coalgebraic Methods in Computer Science",
    "location": "Tallinn, Estonia",
    "url": "http://coalg.org/cmcs12/",
    "series": "LNCS",
    "volume": "7399",
    "pages": "109-129"
  },
  "download": "/files/determinization.pdf",
  "abstract": "<p>This paper takes a fresh look at the topic of trace semantics in the theory of coalgebras. The first development of coalgebraic trace semantics used final coalgebras in Kleisli categories, stemming from an initial algebra in the underlying category (see notably~\\cite{HasuoJS07}). This approach requires some non-trivial assumptions, like dcpo enrichment, which do not always hold, even in cases where one can reasonably speak of traces (like for weighted automata). More recently, it has been noticed (see~\\cite{SBBR10}) that trace semantics can also arise by first performing a determinization construction. In this paper, we develop a systematic approach, in which the two approaches correspond to different orders of composing a functor and a  monad, and accordingly, to different distributive laws. The relevant final coalgebra that gives rise to trace semantics does not live in a Kleisli category, but more generally, in a category of Eilenberg-Moore algebras. In order to exploit its finality, we identify an extension operation, that changes the state space of a coalgebra into a free algebra, which abstractly captures determinization of automata. Notably, we show that the two different views on trace semantics are equivalent, in the examples where both approaches are applicable.</p>"

}, {
  "year": 2012,
  "id": "BBCRS12",
  "authors": ["Filippo Bonchi", "Marcello Bonsangue", "Georgiana Caltais", "Jan Rutten", "Alexandra Silva"],
  "title": "Final semantics for decorated traces",
  "conference": {
    "name": "Proceedings of the Twenty-eighth Conference on the Mathematical Foundations of Programming Semantics",
    "location": "Bath, England",
    "url": "http://dauns.math.tulane.edu/~mfps/MFPS28/MFPS28/MFPS_XXVIII.html/",
    "series": "ENTCS",
    "volume": "286",
    "pages": "73-86"
  },
  "download": "/files/decorated.pdf",
  "abstract": "<p>In concurrency theory, various semantic equivalences on la- belled transition systems are based on traces enriched or decorated with some additional observations. They are generally referred to as decorated traces, and examples include ready, failure, trace and complete trace equivalence. Using the generalized powerset construction, recently introduced by a subset of the authors (FSTTCS’10), we give a coalgebraic presentation of decorated trace semantics. This yields a uniform notion of canonical, minimal representatives for the various decorated trace equivalences, in terms of final Moore automata. As a consequence, proofs of decorated trace equivalence can be given by coinduction, using different types of (Moore-) bisimulation, which is helpful for automation.</p>"

}, {
  "year": 2012,
  "id": "ABHKMS12",
  "authors": ["Jirí Adámek", "Filippo Bonchi", "Mathias Hülsbusch", "Barbara König", "Stefan Milius", "Alexandra Silva"],
  "title": "A coalgebraic perspective on minimization and  determinization",
  "conference": {
    "name": "Proceedings of the Fifteenth International Conference on Foundations of Software Science and Computation structures",
    "location": "Tallinn, Estonia",
    "url": "http://www.itu.dk/research/fossacs-2012/",
    "series": "ARCoSS",
    "volume": "7213",
    "pages": "58-73",
    "note": "This paper contains part of the results of the CWI technical report SEN-1106 (see below)"
  },
  "download": "/files/fossacs12-extended.pdf",
  "abstract": "<p>Coalgebra offers a unified theory of state based systems, including infinite streams, labelled transition systems and deterministic automata. In this paper, we use the coalgebraic view on systems to derive, in a uniform way, abstract procedures for checking behavioural equivalence in coalgebras, which perform (a combination of) minimization and determinization. First, we show that for coalgebras in categories equipped with factorization structures, there exists an abstract procedure for equivalence checking. Then, we consider coalgebras in categories without suitable factorization structures: under certain conditions, it is possible to apply the above procedure after transforming coalgebras with reflections. This transformation can be thought of as some kind of determinization. We will apply our theory to the following examples: conditional transition systems and (non-deterministic) automata</p>"

}, {
  "year": 2012,
  "id": "BCS12",
  "authors": ["Marcello Bonsangue", "Dave Clarke", "Alexandra Silva"],
  "title": "A model of context-dependent component connectors",
  "journal": {
    "name": "Science of Computer Programming",
    "volume": "77(6)",
    "pages": "685-706"
  },
  "download": "http://dx.doi.org/10.1016/j.scico.2011.01.006",
  "abstract": "<p>Recent approaches to component-based software engineering employ coordinat- ing connectors to compose components into software systems. For maximum flexibility and reuse, such connectors can themselves be composed, resulting in an expressive calculus of connectors whose semantics encompasses complex combinations of synchronisation, mutual exclusion, non-deterministic choice and state-dependent behaviour. A more expressive notion of connector includes also context-dependent behaviour, namely, whenever the choices a connector can take change non-monotonically as the context, given by the pending activity on its ports, changes. Context dependency can express notions of priority and inhibition. Capturing context-dependent behaviour in formal models is non-trivial, as it is unclear how to propagate context information through composition. In this paper we present an intuitive automata-based formal model of context- dependent connectors, and argue that it is superior to previous attempts at such a model for the coordination language Reo.</p>"

}, {
  "year": 2011,
  "id": "tr-brz",
  "authors": ["Filippo Bonchi", "Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": "Brzozowski's algorithm (co)algebraically",
  "techreport": {
    "type": "CWI technical report",
    "number": "SEN 11-14",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/18796/18796D.pdf",
  "abstract": "<p>We give a new presentation of Brzozowski's algorithm to minimize finite automata, using elementary facts from universal algebra and coalgebra, and building on earlier work by Arbib and Manes on the duality between reachability and observability. This leads to a simple proof of its correctness and opens the door to further generalizations.</p>"

}, {
  "year": 2011,
  "id": "MASSV11",
  "authors": ["Young-Joo Moon", "Farhad Arbab", "Alexandra Silva", "Andries Stam", "Chrétien Verhoef"],
  "title": "Stochastic Reo: a case study",
  "conference": {
    "name": "Proceedings of the 5th International Workshop on Harnessing Theories for Tool Support in Software",
    "location": "Oslo, Norway",
    "url": "http://facs2011.ifi.uio.no/index.php?n=TTSS.TTSS2011"
  },
  "download": "/files/ttss11.pdf",
  "abstract": "<p>QoS analysis of coordinated distributed autonomous services is currently of interest in the area of service-oriented computing and calls for new technologies and supporting tools. In previous work, the first three authors have proposed a compositional automata model to provide semantics for stochastic Reo, a channel based coordination language that supports the specification of QoS values (such as request arrivals or processing rates). Furthermore, translations from this automata model into stochastic models, such as continuous-time Markov chains (CTMCs) and interactive Markov chains (IMCs) have also been presented.</p><p>Based on those results, we describe in this paper a case study of QoS analysis. We analyze a certain instance of the ASK system, an industrial software system for connecting people offering professional services to clients requiring those services. We develop a model of the ASK system using stochastic Reo. The distributions used in this model were obtained by applying statistical analysis techniques on the raw values that we obtained from the real logs of an actual running ASK system. These distributions are used for the derived CTMC model for the ASK system to analyze and to improve the performance of the system, under the assumption that the distributions are exponentially distributed. In practice, this is not always the case. Thus, we also carry out a simulation-based analysis by a Reo simulator that can deal with non-exponential distributions. Compared to the analysis on the derived CTMC model, the simulation is approximation-based analysis, but it reveals valuable insight in the behavior of the system. The outcome of both analyses helps both the developers and the installations of the ASK system to improve the performance of the system.</p>"

}, {
  "year": 2011,
  "id": "KS11b",
  "authors": ["Dexter Kozen", "Alexandra Silva"],
  "title": "Left-handed completeness",
  "techreport": {
    "type": "Technical Report",
    "number": "1813/23556",
    "institution": "Cornell University"
  },
  "download": "http://hdl.handle.net/1813/23556",
  "abstract": "<p>We give a new, significantly shorter proof of the completeness of the left-handed star rule of Kleene algebra. The proof reveals the rich interaction of algebra and coalgebra in the theory.</p>"

}, {
  "year": 2011,
  "id": "BBGS11",
  "authors": ["Sonia Ben Mokhtar", "Simon Bliudze", "Roberto Bruni", "Alexandra Silva", "Angelo Troina"],
  "title": "Concurrency and Interaction in Complex Systems (special issue with selected papers of the Discotec'10 workshops)",
  "download": "http://www.infoiasi.ro/bin/Annals/XXI",
  "edited": {
    "publisher": "\"Alexandru Ioan Cuza\" University of Iasi",
    "series": "Scientific Annals of Computer Science",
    "volume": "XXI"
  }

}, {
  "year": 2011,
  "id": "Silva11a",
  "authors": ["Alexandra Silva"],
  "title": "A Specification Language for Reo Connectors",
  "conference": {
    "name": "Proceedings of the Fundamentals of Software Engineering - 4th IPM International Conference",
    "location": "Tehran, Iran",
    "url": "http://fsen.ir/2011/",
    "series": "LNCS",
    "volume": "7141",
    "pages": "368-376",
    "note": "An extended version of this paper appeared as CWI technical report SEN-1102 (see below)"
  },
  "download": "http://dx.doi.org/10.1007/978-3-642-29320-7_26",
  "abstract": "<p>Recent approaches to component-based software engineering employ coordinating connectors to compose components into software systems. Reo is amodel of component coordination, wherein complex connectors are constructed by composing various types of primitive channels. Reo automata are a simple and intuitive formal model of context- dependent connectors, which provided a compositional semantics for Reo. In this paper, we study Reo automata from a coalgebraic perspective. This enables us to apply the recently developed coalgebraic theory of generalized regular expressions in order to derive a specification language, tailor-made for Reo automata, and sound and complete axiomatizations with respect to three distinct notions of equivalence: (coalgebraic) bisimilarity, the bisimulation notion studied in the original papers on Reo automata and trace equivalence. The obtained language is simple, but nonetheless expressive enough to specify all possible finite Reo automata. Moreover, it comes equipped with a Kleene-like theorem: we provide algorithms to translate expressions to Reo automata and, conversely, to compute an expression equivalent to a state in a Reo automaton.</p>"

}, {
  "year": 2011,
  "id": "BBCS11",
  "authors": ["Simon Bliudze", "Roberto Bruni", "Marco Carbone", "Alexandra Silva"],
  "title": "Proceedings ICE 2011",
  "edited": {
    "publisher": "ArXiv",
    "series": "EPTCS",
    "volume": 59
  },
  "download": "http://arxiv.org/html/1108.0144v1"

}, {
  "year": 2011,
  "id": "JNRS11",
  "authors": ["Bart Jacobs", "Milad Niqui", "Jan Rutten", "Alexandra Silva"],
  "title": "Special issue CMCS Tenth Anniversary Meeting",
  "edited": {
    "publisher": "Elsevier",
    "series": "TCS",
    "volume": 412,
    "number": 38,
    "pages": "4967-5110"
  },
  "download": "http://www.sciencedirect.com/science/article/pii/S0304397511004701"

}, {
  "year": 2011,
  "id": "KS11a",
  "authors": ["Dexter Kozen", "Alexandra Silva"],
  "title": "On Moessner's theorem",
  "techreport": {
    "type": "Technical Report",
    "number": "1813/22959",
    "institution": "Cornell University"
  },
  "download": "http://hdl.handle.net/1813/22959",
  "abstract": "<p>Moessner's theorem describes a procedure for generating a sequence of n integer sequences that lead unexpectedly to the sequence of nth powers 1n, 2n, 3n, ... Paasche's theorem is a generalization of Moessner's; by varying the parameters of the procedure, one can obtain the sequence of factorials 1!, 2!, 3!, ... or the sequence of superfactorials 1!!, 2!!, 3!!, ... Long's theorem generalizes Moessner's in another direction, providing a procedure to generate the sequence a1n-1, (a+d)2n-1, (a+2d)3n-1, ... Proofs of these results in the literature are typically based on combinatorics of binomial coefficients or calculational scans.  In this note we give a short and revealing algebraic proof of a general theorem that contains Moessner's, Paasche's, and Long's as special cases.  We also prove a generalization that gives new Moessner-type theorems</p>"

}, {
  "year": 2011,
  "id": "SS11",
  "authors": ["Alexandra Silva", "Ana Sokolova"],
  "title": "Sound and Complete Axiomatization of Trace Semantics for Probabilistic Systems",
  "conference": {
    "name": "Proceedings of the Twenty-seventh Conference on the Mathematical Foundations of Programming Semantics",
    "location": "Pittsburgh, PA",
    "url": "http://dauns.math.tulane.edu/~mfps/MFPS27/MFPS_XXVII.html",
    "series": "ENTCS",
    "volume": "276",
    "pages": "291-311"
  },
  "download": "/files/mfps11.pdf",
  "abstract": "<p>We present a sound and complete axiomatization of finite complete trace semantics for generative probabilistic transition systems. Our approach is coalgebraic, which opens the door to axiomatize other types of systems. In order to prove soundness and completeness, we employ determinization and show that coalgebraic traces can be recovered via determinization, a result interesting in itself. The approach is also applicable to labelled transition systems, for which we can recover the known axiomatization of trace semantics (work of Rabinovich).</p>"

}, {
  "year": 2011,
  "id": "SBBR11",
  "authors": ["Alexandra Silva", "Filippo Bonchi", "Marcello Bonsangue", "Jan Rutten"],
  "title": "Quantitative Kleene coalgebras",
  "journal": {
    "name": "Information and Computation",
    "volume": "209",
    "number": "5",
    "pages": "822-849"
  },
  "download": "/files/ic-concur.pdf",
  "abstract": "<p>We present a systematic way to generate (1) languages of (generalised) regular expressions,  and (2) sound and complete axiomatizations thereof, for a wide variety of quantitative systems.  Our quantitative systems include weighted versions of automata and transition systems, in which transitions are assigned a value in a monoid that represents cost, duration, probability, etc. Such systems are represented as coalgebras and (1) and (2) above are derived in a modular fashion from the underlying (functor) type of these coalgebras. In previous work, we applied a similar approach to a class of systems (without weights) that generalizes both the results of Kleene (on rational languages and DFA’s) and Milner (on regular behaviours and finite LTS’s), and includes many other systems such as Mealy and Moore machines.In the present paper, we extend this framework to deal with quantitative systems. As a consequence, our results now include languages and axiomatizations, both existing and new ones, for many different kinds of probabilistic systems.</p>"

}, {
  "year": 2011,
  "id": "BMS11-draft",
  "authors": ["Marcello Bonsangue", "Stefan Milius", "Alexandra Silva"],
  "title": "Sound and complete axiomatizations of coalgebraic language equivalence",
  "unpublished": "A revised version of this paper was accepted for publication in ACM TOCL (see above)",
  "download": "/files/BMS-11-draft.pdf",
  "abstract": "<p>Coalgebras provide a uniform framework to study dynamical systems, including several types of automata. In this paper, we make use of the coalgebraic view on systems to investigate, in a uniform way, under which conditions calculi that are sound and complete with respect to behavioral equivalence can be extended to a coarser coalgebraic language equivalence, which arises from a generalised powerset construction. We illustrate the framework with two examples: non-deterministic automata, for which we recover Rabinovich’s sound and complete calculus for language equivalence, and weighted automata, for which we present the first sound and complete calculus for weighted language equivalence.</p>"

}, {
  "year": 2011,
  "id": "tr-lwa",
  "authors": ["Filippo Bonchi", "Marcello Bonsangue", "Michele Boreale", "Jan Rutten", "Alexandra Silva"],
  "title": "A coalgebraic perspective on linear weighted automata",
  "techreport": {
    "type": "CWI technical report",
    "number": "SEN 11-04",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/18069/18069A.pdf",
  "abstract": "<p>Weighted automata are a generalization of non-deterministic automata where each transition, in addition to an input letter, has also a quantity expressing the weight (e.g. cost or probability) of its execution. As for non-deterministic automata, their behaviours can be expressed in terms of either (weighted) bisimilarity or (weighted) language equivalence.Coalgebras provide a categorical framework for the uniform study of state-based systems and their behaviours. In this work, we show that coalgebras can suitably model weighted automata in two different ways: coalgebras on Set (the category of sets and functions) characterize weighted bisimilarity, while coalgebras on Vect (the category of vector spaces and linear maps) characterize weighted language equivalence.Relying on the second characterization, we show three different procedures for computing weighted language equivalence. The first one consists in a generalization of the usual partition refinement algorithm for ordinary automata. The second one is the backward version of the first one. The third procedure relies on a syntactic representation of rational weighted languages.</p>"

}, {
  "year": 2011,
  "id": "BG11",
  "authors": ["Marcello Bonsangue", "Georgiana Caltais", "Eugen Goriac", "Dorel Lucanu", "Jan Rutten", "Alexandra Silva"],
  "title": " Automatic equivalence proofs for non-deterministic coalgebras (revised and extended)",
  "techreport": {
    "type": "CWI technical report",
    "number": "SEN 11-13",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/18793/18793D.pdf",
  "abstract": "<p>A notion of generalized regular expressions for a large class of systems modeled as coalgebras, and an analogue of Kleene’s theorem and Kleene algebra, were recently proposed by a subset of the authors of this paper. Examples of the systems covered include infinite streams, deterministic automata, Mealy machines and labelled transition sytems. In this paper, we present a novel algorithm to decide whether two expressions are bisimilar or not. The procedure is implemented in the automatic theorem prover CIRC, by reducing coinduction to an entailment relation between an algebraic specification and an appropriate set of equations. We illustrate the generality of the tool with three examples: infinite streams of real numbers, Mealy machines and labelled transition systems.</p>"

}, {
  "year": 2011,
  "id": "BHKS11",
  "authors": ["Filippo Bonchi", "Mathias Hülsbusch", "Barbara König", "Alexandra Silva"],
  "title": "A coalgebraic perspective on minimization, determinization and behavioural metrics",
  "techreport": {
    "type": "CWI technical report",
    "number": "SEN 11-06",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/18079/18079D.pdf",
  "abstract": "<p>Coalgebra offers a unified theory of state based systems, including infinite streams, labelled transition systems and deterministic automata. In this paper, we use the coalgebraic view on systems to derive, in a uniform way, abstract procedures for checking behavioural equivalence in coalgebras, which perform (a combination of) minimization and determinization in the system. First, we show that for coalgebras on categories equipped with factorization structures, there exists an abstract procedure for equivalence checking. For instance, when considering epi-mono factorizations in the category of sets and functions, this procedure corresponds to the usual (coalgebraic) minimization algorithm and two states are behaviourally equivalent iff they are mapped to the same state in the minimized coalgebra. Second, motivated by several examples, we consider coalgebras on categories without suitable factorization structures: under certain conditions, it is possible to apply the above procedure after transforming coalgebras with reflections. This transformation can be thought of as some kind of determinization. Finally, we show that the result of the procedure also induces a pseudo-metric on the states, in such a way that the distance between each pair of states is minimized.</p>"

}, {
  "year": 2011,
  "id": "SBR11",
  "authors": ["Alexandra Silva", "Marcello Bonsangue", "Jan Rutten"],
  "title": "Kleene Coalgebra: an overview",
  "unpublished": "Nieuwsbrief van de Nederlandse Vereniging voor Theoretische Informatica (NVTI). Nummer 15",
  "download": "/files/2011-nvti.pdf",
  "abstract": "<p>Coalgebras provide a uniform framework for the study of dynamical systems, including several types of automata. The coalgebraic view on systems has recently been proved relevant by the development of a number of expression calculi which generalize classical results by Kleene, on regular expressions, and by Kozen, on Kleene algebra.</p><p>This note contains an overview of the motivation and results of the generic framework we developed – Kleene Coalgebra – to uniformly derive the aforementioned calculi. We present an historical overview of work on regular expressions and axiomatizations, as well a discussion of related work. We show applications of the framework to three types of probabilistic systems: simple Segala, stratified and Pnueli-Zuck.</p>"

}, {
  "year": 2011,
  "id": "Silva11",
  "authors": ["Alexandra Silva"],
  "title": "A specification language for Reo connectors",
  "techreport": {
    "type": "CWI technical report",
    "number": "SEN 11-02",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/18033/18033D.pdf",
  "abstract": "<p>Recent approaches to component-based software engineering employ coordinating connectors to compose components into software systems. Reo is a model of component coordination, wherein complex connectors are constructed by composing various types of primitive channels. Reo automata are a simple and intuitive formal model of context-dependent connectors, which provided a compositional semantics for Reo. In this paper, we study Reo automata from a coalgebraic perspective. This enables us to apply the recently developed coalgebraic theory of generalized regular expressions in order to derive a specification language, tailor-made for Reo automata, and sound and complete axiomatizations with respect to three distinct notions of equivalence: (coalgebraic) bisimilarity, the bisimulation notion studied in the original papers on Reo automata and trace equivalence. The obtained language is simple, but nonetheless expressive enough to specify all possible finite Reo automata. Moreover, it comes equipped with a Kleene-like theorem: we provide algorithms to translate expressions to Reo automata and, conversely, to compute an expression equivalent to a state in a Reo automaton.</p>"

}, {
  "year": 2010,
  "id": "SBBR10",
  "authors": ["Alexandra Silva", "Filippo Bonchi", "Marcello Bonsangue", "Jan Rutten"],
  "title": " Generalizing the powerset construction, coalgebraically",
  "conference": {
    "name": "Proceedings of the IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science",
    "location": "Chennai, India",
    "url": "http://www.fsttcs.org/archives/2010/",
    "series": "LIPICS",
    "volume": "8",
    "pages": "272-283"
  },
  "download": "http://drops.dagstuhl.de/opus/volltexte/2010/2870/pdf/24.pdf",
  "abstract": "<p>Coalgebra is an abstract framework for the uniform study of different kinds of dynamical systems. An endofunctor $F$ determines both the type of systems ($F$-coalgebras) and a notion of behavioral equivalence ($\\sim_F$) amongst them. Many types of transition systems and their equivalences can be captured by a functor $F$. For example, for deterministic automata the derived equivalence is language equivalence, while for non-deterministic automata it is ordinary bisimilarity. The powerset construction is a standard method for converting a nondeterministic automaton into an equivalent deterministic one as far as language is concerned. In this paper, we lift the powerset construction on automata to the more general framework of coalgebras with structured state spaces. Examples of applications include partial Mealy machines, (structured) Moore automata, and Rabin probabilistic automata.</p>"

}, {
  "year": 2010,
  "id": "MSKA10b",
  "authors": ["Young-Joo Moon", "Alexandra Silva", "Christian Krause", "Farhad Arbab"],
  "title": "A Compositional Semantics for Stochastic Reo Connectors",
  "techreport": {
    "type": "CWI technical report",
    "number": "SEN 10-07",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/16529/16529D.pdf",
  "abstract": "<p>In this paper we present a compositional semantics for the channel-based coordination language Reo which enables the analysis of quality of service (QoS) properties of service compositions. For this purpose, we annotate Reo channels with stochastic delay rates and explicitly model data-arrival rates at the boundary of a connector, to capture its interaction with the services that comprise its environment. We propose Stochastic Reo automata as an extension of Reo automata, in order to compositionally derive a QoS-aware semantics for Reo. We further present a translation of Stochastic Reo automata to Continuous-Time Markov Chains (CTMCs). This translation enables us to use third- party CTMC verification tools to do an end-to-end performance analysis of service compositions.</p>"

}, {
  "year": 2010,
  "id": "SBBR10a",
  "authors": ["Alexandra Silva", "Filippo Bonchi", "Marcello Bonsangue", "Jan Rutten"],
  "title": " Generalizing the powerset construction, coalgebraically",
  "techreport": {
    "type": "CWI technical report",
    "number": "SEN 10-08",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/16981/16981D.pdf",
  "abstract": "<p>Coalgebra is an abstract framework for the uniform study of different kinds of dynamical systems. An endofunctor $F$ determines both the type of systems ($F$-coalgebras) and a notion of behavioral equivalence ($\\sim_F$) amongst them. Many types of transition systems and their equivalences can be captured by a functor $F$. For example, for deterministic automata the derived equivalence is language equivalence, while for non-deterministic automata it is ordinary bisimilarity. The powerset construction is a standard method for converting a nondeterministic automaton into an equivalent deterministic one as far as language is concerned. In this paper, we lift the powerset construction on automata to the more general framework of coalgebras with structured state spaces. Examples of applications include partial Mealy machines, (structured) Moore automata, and Rabin probabilistic automata.</p>"

}, {
  "year": 2010,
  "id": "BG10",
  "authors": ["Marcello Bonsangue", "Georgiana Caltais", "Eugen Goriac", "Dorel Lucanu", "Jan Rutten", "Alexandra Silva"],
  "title": " A decision procedure for bisimilarity of generalized regular expressions",
  "conference": {
    "name": "Proceedings of the 13th Brazilian Symposium on Formal Methods",
    "location": "Natal, Brazil",
    "url": "http://sbmf2010.dimap.ufrn.br/",
    "series": "LNCS",
    "volume": "6527",
    "pages": "226-241",
    "note": "An extended version appears as CWI technical report SEN-1109 (see above)"
  },
  "download": "/files/sbmf10.pdf",
  "abstract": "<p>A notion of generalized regular expressions for a large class of systems modeled as coalgebras, and an analogue of Kleene’s theorem and Kleene algebra, were recently proposed by a subset of the authors of this paper. Examples of the systems covered include infinite streams, deterministic automata and Mealy machines. In this paper, we present a tool where the aforementioned expressions can be derived automatically and a novel algorithm to decide whether two expressions are bisimilar or not. The procedure is implemented in the automatic theorem prover CIRC, by reducing coinduction to an entailment relation between an algebraic specification and an appropriate set of equations.</p>"

}, {
  "year": 2010,
  "id": "MSKA10",
  "authors": ["Young-Joo Moon", "Alexandra Silva", "Christian Krause", "Farhad Arbab"],
  "title": "A Compositional Semantics for Stochastic Reo Connectors",
  "conference": {
    "name": "Proceedings of the 9th International Workshop on the Foundations of Coordination Languages and Software Architectures",
    "location": "Paris, France",
    "url": "http://foclasa.lcc.uma.es/foclasa10/welcome.html",
    "series": "EPTCS",
    "volume": "30",
    "pages": "93-107"
  },
  "download": "http://arxiv.org/pdf/1007.5094v1",
  "abstract": "<p>In this paper we present a compositional semantics for the channel-based coordination language Reo which enables the analysis of quality of service (QoS) properties of service compositions. For this purpose, we annotate Reo channels with stochastic delay rates and explicitly model data-arrival rates at the boundary of a connector, to capture its interaction with the services that comprise its environment. We propose Stochastic Reo automata as an extension of Reo automata, in order to compositionally derive a QoS-aware semantics for Reo. We further present a translation of Stochastic Reo automata to Continuous-Time Markov Chains (CTMCs). This translation enables us to use third- party CTMC verification tools to do an end-to-end performance analysis of service compositions.</p>"

}, {
  "year": 2010,
  "id": "SBR10b",
  "authors": ["Alexandra Silva", "Marcello Bonsangue", "Jan Rutten"],
  "title": "Non-deterministic Kleene Coalgebras",
  "journal": {
    "name": "Logical Methods in Computer Science",
    "volume": 6,
    "number": 3,
    "pages": "1-39"
  },
  "download": "http://arxiv.org/pdf/1007.3769",
  "abstract": "<p>In this paper, we present a systematic way of deriving (1) languages of (generalized) regular expressions, and (2) sound and complete axiomatizations thereof, for a wide variety of systems. This generalizes both the results of Kleene (on regular languages and deterministic finite automata) and Milner (on regular behaviours and finite labelled transition systems), and includes many other systems such as Mealy and Moore machines.</p>"

}, {
  "year": 2010,
  "id": "SBR10a",
  "authors": ["Alexandra Silva", "Marcello Bonsangue", "Jan Rutten"],
  "title": "Non-deterministic Kleene Coalgebras",
  "techreport": {
    "type": "CWI technical report",
    "number": "SEN 10-01",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/14942/14942D.pdf",
  "abstract": "<p>In this paper, we present a systematic way of deriving (1) languages of (generalized) regular expressions, and (2) sound and complete axiomatizations thereof, for a wide variety of systems. This generalizes both the results of Kleene (on regular languages and deterministic finite automata) and Milner (on regular behaviours and finite labelled transition systems), and includes many other systems such as Mealy and Moore machines.</p>"

}, {
  "year": 2010,
  "id": "BBGS10",
  "authors": ["Simon Bliudze", "Roberto Bruni", "Davide Grohmann", "Alexandra Silva"],
  "title": "Proceedings ICE 2010",
  "edited": {
    "publisher": "ArXiv",
    "series": "EPTCS",
    "volume": 38
  },
  "download": "http://arxiv.org/html/1010.5308"

}, {
  "year": 2010,
  "id": "SR10",
  "authors": ["Alexandra Silva", "Jan Rutten"],
  "title": "A coinductive calculus of binary trees",
  "journal": {
    "name": "Information and Computation",
    "volume": 208,
    "number": 5,
    "pages": "578-593"
  },
  "download": "/files/2010-Rutten-Silva-IC.pdf",
  "abstract": "<p>We study the set TA of infinite binary trees with nodes labelled in a semiring A from a coalgebraic perspective. We present coinductive definition and proof principles based on the fact that TA carries a final coalgebra structure. By viewing trees as formal power series, we develop a calculus where definitions are presented as behavioural differential equations. We present a general format for these equations that guarantees the existence and uniqueness of solutions. Although technically not very difficult, the resulting framework has surprisingly nice applications, which is illustrated by various concrete examples.</p>"

}, {
  "year": 2010,
  "id": "JNRS10b",
  "authors": ["Bart Jacobs", "Milad Niqui", "Jan Rutten", "Alexandra Silva"],
  "title": "Proceedings CMCS 2010",
  "edited": {
    "publisher": "Elsevier",
    "series": "ENTCS",
    "volume": 264,
    "number": 2,
    "pages": "1-198"
  },
  "download": "http://www.sciencedirect.com/science/journal/15710661"

}, {
  "year": 2010,
  "id": "JNRS10a",
  "authors": ["Bart Jacobs", "Milad Niqui", "Jan Rutten", "Alexandra Silva"],
  "title": "Short Contributions CMCS 2010",
  "edited": {
    "series": "CWI Technical Report SEN-1004",
    "pages": "1-32",
    "publisher": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/15616/15616D.pdf"

}, {
  "year": 2009,
  "id": "BCS09b",
  "authors": ["Marcello Bonsangue", "Dave Clarke", "Alexandra Silva"],
  "title": "A model of context-dependent component connectors",
  "techreport": {
    "type": "Technical Report",
    "number": "SEN-0903",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/14628/14628D.pdf",
  "abstract": "<p>Recent approaches to component-based software engineering employ coordinat- ing connectors to compose components into software systems. For maximum flexibility and reuse, such connectors can themselves be composed, resulting in an expressive calculus of connectors whose semantics encompasses complex combinations of synchronisation, mutual exclusion, non-deterministic choice and state-dependent behaviour. A more expressive notion of connector includes also context-dependent behaviour, namely, whenever the choices a connector can take change non-monotonically as the context, given by the pending activity on its ports, changes. Context dependency can express notions of priority and inhibition. Capturing context-dependent behaviour in formal models is non-trivial, as it is unclear how to propagate context information through composition. In this paper we present an intuitive automata-based formal model of context- dependent connectors, and argue that it is superior to previous attempts at such a model for the coordination language Reo.</p>"

}, {
  "year": 2009,
  "id": "BBRS09a",
  "authors": ["Filippo Bonchi", "Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": " Quantitative regular behaviours",
  "download": "/files/calco-jnr2009.pdf",
  "unpublished": "Calco-jnr 2009, Udine, Italy",
  "abstract": "<p>We present a systematic way to generate (1) languages of (generalised) regular expressions, and (2) sound and complete axiomatizations thereof, for a wide variety of quantitative systems. Our quantitative systems include weighted versions of automata and transition systems, in which transitions are assigned a value in a monoid that represents cost, duration, probability, etc. Such systems are represented as coalgebras and (1) and (2) above are derived in a modular fashion from the underlying (functor) type of these coalgebras.</p><p>In previous work, we applied a similar approach to a class of systems (without weights), coalgebras for the so-called Kripke-polynomial functors, that generalizes both the results of Kleene (on rational languages and DFA's) and Milner (on regular behaviours and finite LTS's), and includes many other systems such as Mealy and Moore machines.</p><p>We now enlarge this framework to deal with quantitative systems. To this end, we give a non-trivial extension of the class of Kripke-polynomial functors by adding a functor type that allows the transitions of our systems to take values in a monoid structure of quantitative values. This new class, which we shall call quantitative functors, now includes weighted automata and several probabilistic systems. At the same time, we extend our earlier approach to the new setting. This will allow us to derive for each functor in our new extended class everything we were after: a language of regular expressions; a corresponding Kleene Theorem; and a sound and complete axiomatization for the corresponding notion of behavioural equivalence.</p><p>As a consequence, our results now include languages and axiomatizations, both existing and new ones, for weighted automata and many different kinds of probabilistic systems. Table 1 shows three examples of derived languages and axiomatizations.</p>"

}, {
  "year": 2009,
  "id": "BBRS09",
  "authors": ["Filippo Bonchi", "Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": " Deriving Syntax and axioms for quantitative regular behaviours",
  "conference": {
    "name": "Proceedings of the 20th International Conference on Concurrency Theory",
    "location": "Bologna, Italy",
    "url": "http://concur09.cs.unibo.it/",
    "series": "LNCS",
    "volume": "5710",
    "pages": "146-162"
  },
  "download": "/files/concur09.pdf",
  "abstract": "<p>We present a systematic way to generate (1) languages of (generalised) regular expressions, and (2) sound and complete axiomatizations thereof, for a wide variety of quantitative systems. Our quantitative systems include weighted versions of automata and transition systems, in which transitions are assigned a value in a monoid that represents cost, duration, probability, etc. Such systems are represented as coalgebras and (1) and (2) above are derived in a modular fashion from the underlying (functor) type of these coalgebras.</p><p>In previous work, we applied a similar approach to a class of systems (without weights) that generalizes both the results of Kleene (on rational languages and DFA’s) and Milner (on regular behaviours and finite LTS’s), and includes many other systems such as Mealy and Moore machines.</p><p>In the present paper, we extend this framework to deal with quantitative systems. As a consequence, our results now include languages and axiomatizations, both existing and new ones, for many different kinds of probabilistic systems.</p>"

}, {
  "year": 2009,
  "id": "BRS09b",
  "authors": ["Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": "Algebras for Kripke polynomial coalgebras",
  "conference": {
    "name": "Proceedings of the Twenty-Fourth Annual IEEE Symposium on Logic in Computer Science",
    "location": "Los Angeles, CA, USA",
    "url": "http://www2.informatik.hu-berlin.de/lics/lics09/",
    "series": "IEEE",
    "pages": "49-58"
  },
  "download": "/files/lics-draft.pdf",
  "abstract": "<p>Several dynamical systems, like deterministic automata and labelled transition systems, can be described as coalgebras of so-called Kripke polynomial functors, built up from constants and identities, using product, coproduct and powerset. Locally finite Kripke polynomial coalgebras can be characterized up to bisimulation by a specification language that generalizes Kleene’s regular expressions for finite automata. In this paper, we equip this specification language with an axiomatization and prove it sound and complete with respect to bisimulation, using a purely coalgebraic argument. We demonstrate the usefulness of our framework by providing an alternative finite equational system for (non-)deterministic finite automata, labelled transition systems with explicit termination, and automata on guarded strings.</p>"

}, {
  "year": 2009,
  "id": "BCS09",
  "authors": ["Marcello Bonsangue", "Dave Clarke", "Alexandra Silva"],
  "title": "Automata for Context-dependent Connectors",
  "conference": {
    "name": "Proceedings of the Eleventh International Conference on Coordination Models and Languages",
    "location": "Lisboa, Portugal",
    "url": "http://discotec09.di.fc.ul.pt/index.php?title=Coordination",
    "series": "LNCS",
    "volume": "5521",
    "pages": "184-203"
  },
  "download": "/files/coord09.pdf",
  "abstract": "<p>Recent approaches to component-based software engineering employ coordinating connectors to compose components into software systems. For maximum flexibility and reuse, such connectors can themselves be composed, resulting in an expressive calculus of connectors whose semantics encompasses complex combinations of synchronisation, mutual exclusion, non-deterministic choice and state-dependent behaviour. A more expressive notion of connector includes also context-dependent behaviour, namely, whenever the choices the connector can take change non-monotonically as the context, given by the pending activity on its ports, changes. Context dependency can express notions of priority and inhibition. Capturing context-dependent behaviour in formal models is non-trivial, as it is unclear how to propagate context information through composition. In this paper we present an intuitive automata-based formal model of context-dependent connectors, and argue that it is superior to previous attempts at such a model for the coordination language Reo.</p>"

}, {
  "year": 2009,
  "id": "BRS09a",
  "authors": ["Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": " A Kleene theorem for polynomial coalgebras.",
  "conference": {
    "name": "Proceedings of the Twelfth International Conference on Foundations of Software Science and Computation structures",
    "location": "York, United Kingdom",
    "url": "http://fossacs09.soe.ucsc.edu/",
    "series": "LNCS",
    "volume": "5504",
    "pages": "122-136",
    "note": "A previous version appeared as CWI technical report SEN-0703 (see below)"
  },
  "download": "/files/BRS09a.pdf",
  "abstract": "<p>For polynomial functors G, we show how to generalize the classical notion of regular expression to G-coalgebras. We introduce a language of expressions for describing elements of the final G-coalgebra and, analogously to Kleene’s theorem, we show the correspondence between expressions and finite G-coalgebras.</p>"

}, {
  "year": 2008,
  "id": "BOS08",
  "authors": ["Luís Barbosa", "Nuno Oliveira", "Alexandra Silva"],
  "title": "Calculating invariants as coreflexive bisimulations",
  "conference": {
    "name": "Proceedings of the 12th International Conference on Algebraic Methodology and Software Technology",
    "location": "Urbana, Illinois, USA ",
    "url": "http://amast08.cs.uiuc.edu/",
    "series": "LNCS",
    "volume": "5140",
    "pages": "83-99"
  },
  "download": "/files/BOS08.pdf",
  "abstract": "<p>Invariants, bisimulations and assertions are the main ingredients of coalgebra theory applied to software systems. In this paper we reduce the first to a particular case of the second and show how both together pave the way to a theory of coalgebras which regards invariant predicates as types. An outcome of such a theory is a calculus of invariants' proof obligation discharge, a fragment of which is presented in the paper.</p><p>The approach has two main ingredients: one is that of adopting relations as \"first class citizens\" in a pointfree reasoning style; the other lies on a synergy found between a relational construct, Reynolds' relation on functionsinvolved in the abstraction theoremon parametric polymorphism and the coalgebraic account of bisimulations and invariants. This leads to an elegant proof of the equivalence between two different definitions of bisimulation found in coalgebra literature (due to B. Jacobs and Aczel and Mendler, respectively) and to their instantiation to the classical Park-Milner definition popular in process algebra.</p>"

}, {
  "year": 2008,
  "id": "BRS08a",
  "authors": ["Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": "Regular expressions for polynomial coalgebras",
  "unpublished": "CMCS 2008 (short contributions), Budapest, Hungary",
  "download": "/files/cmcs08-short.pdf",
  "abstract": "<p>For polynomial set functors G, we generalize the notion of regular expressions and introduce a language of expressions for describing elements of the final G-coalgebra. We show that every state of a finite G-coalgebra corresponds to an expression in the language, in the sense that they both have the same semantics. Conversely, we give a compositional synthesis algorithm which transforms every expression into a finite G-coalgebra. The language of expressions is equipped with an equational system that is sound, complete and expressive with respect to G-bisimulation.</p>"

}, {
  "year": 2008,
  "id": "BRS08",
  "authors": ["Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": "Coalgebraic logic and synthesis of mealy machines",
  "conference": {
    "name": "Proceedings of the Eleventh International Conference on Foundations of Software Science and Computation structures",
    "location": "Budapest, Hungary",
    "url": "http://fossacs08.pps.jussieu.fr/",
    "series": "LNCS",
    "volume": "4962",
    "pages": "231-245",
    "note": "A previous version appeared as CWI technical report SEN-0705 (see below)"
  },
  "download": "/files/mealy.pdf",
  "abstract": "<p>We present a novel coalgebraic logic for deterministic Mealy machines that is sound, complete and expressive w.r.t. bisimulation. Every finite Mealy machine corresponds to a finite formula in the language. For the converse, we give a compositional synthesis algorithm which transforms every formula into a finite Mealy machine whose behaviour is exactly the set of causal functions satisfying the formula.</p>"

}, {
  "year": 2007,
  "id": "SR07c",
  "authors": ["Alexandra Silva", "Jan Rutten"],
  "title": "A coinductive calculus of binary trees",
  "techreport": {
    "type": "Technical Report",
    "number": "SEN-0707",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/11938/11938D.pdf",
  "abstract": "<p>We study the set TA of infinite binary trees with nodes labelled in a semiring A from a coalgebraic perspective. We present coinductive definition and proof principles based on the fact that TA carries a final coalgebra structure. By viewing trees as formal power series, we develop a calculus where definitions are presented as behavioural differential equations. We present a general format for these equations that guarantees the existence and uniqueness of solutions. Although technically not very difficult, the resulting framework has surprisingly nice applications, which is illustrated by various concrete examples.</p>"

}, {
  "year": 2007,
  "id": "BRS07b",
  "authors": ["Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": "Regular expressions for polynomial coalgebras",
  "techreport": {
    "type": "Technical Report",
    "number": "SEN-0703",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/11926/11926D.pdf",
  "abstract": "<p>For polynomial set functors G, we introduce a language of expressions for describing elements of final G-coalgebra. We show that every state of a finite G-coalgebra corresponds to an expression in the language, in the sense that they both have the same semantics. Conversely, we give a compositional synthesis algorithm which transforms every expression into a finite G-coalgebra. The language of expressions is equipped with an equational system that is sound, complete and expressive with respect to G-bisimulation.</p>"

}, {
  "year": 2007,
  "id": "BRS07a",
  "authors": ["Marcello Bonsangue", "Jan Rutten", "Alexandra Silva"],
  "title": "Coalgebraic logic and synthesis of Mealy machines",
  "techreport": {
    "type": "Technical Report",
    "number": "SEN-0705",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/11925/11925D.pdf",
  "abstract": "<p>We present a novel coalgebraic logic for deterministic Mealy machines that is sound, complete and expressive w.r.t. bisimulation. Every finite Mealy machine corresponds to a finite formula in the language. For the converse, we give a compositional synthesis algorithm which transforms every formula into a finite Mealy machine whose behaviour is exactly the set of causal functions satisfying the formula.</p>"

}, {
  "year": 2007,
  "id": "Silva07",
  "authors": ["Alexandra Silva"],
  "title": "A coalgebraic view on bi-infinite streams",
  "download": "/files/calco-jnr2007.pdf",
  "unpublished": "Calco-jnr 2007, Bergen, Norway",
  "abstract": "<p>Bi-infinite streams arise as a natural data structure in several contexts, such as signal processing, symbolic dynamics, (balanced) representation of real/rational numbers or study of sets invariant under shift transformation. In this paper, we will present a coalgebraic view of the set of bi-infinite streams.</p>"

}, {
  "year": 2007,
  "id": "SR07b",
  "authors": ["Alexandra Silva", "Jan Rutten"],
  "title": "Behavioural differential equations and coinduction for binary trees.",
  "conference": {
    "name": "Proceedings of the Workshop on Logic, Language, Information and Computation 2007",
    "location": "Rio de Janeiro, Brazil",
    "url": "http://www.cin.ufpe.br/~wollic/wollic2007/",
    "series": "LNCS",
    "pages": "322 - 336",
    "note": "This paper has an extended version published in 2009 in Information and Computation (see above)"
  },
  "download": "/files/wollic2007.pdf",
  "abstract": "<p>We study the set TA of infinite binary trees with nodes labelled in a semiring A from a coalgebraic perspective. We present coinductive definition and proof principles based on the fact that TA carries a final coalgebra structure. By viewing trees as formal power series, we develop a calculus where definitions are presented as behavioural differential equations. We present a general format for these equations that guarantees the existence and uniqueness of solutions. Although technically not very difficult, the resulting framework has surprisingly nice applications, which is illustrated by various concrete examples.</p>"

}, {
  "year": 2007,
  "id": "SR07a",
  "authors": ["Alexandra Silva", "Jan Rutten"],
  "title": "Behavioural differential equations and coinduction for binary trees.",
  "techreport": {
    "type": "Technical Report",
    "number": "SEN-0702",
    "institution": "Centrum Wiskunde & Informatica"
  },
  "download": "http://oai.cwi.nl/oai/asset/11939/11939D.pdf",
  "abstract": "<p>We study the set TA of infinite binary trees with nodes labelled in a semiring A from a coalgebraic perspective. We present coinductive definition and proof principles based on the fact that TA carries a final coalgebra structure. By viewing trees as formal power series, we develop a calculus where definitions are presented as behavioural differential equations. We present a general format for these equations that guarantees the existence and uniqueness of solutions. Although technically not very difficult, the resulting framework has surprisingly nice applications, which is illustrated by various concrete examples.</p>"

}, {
  "year": 2006,
  "id": "SV06",
  "authors": ["Alexandra Silva", "Joost Visser"],
  "title": "Strong types for relational databases",
  "conference": {
    "name": "Proceedings of the 2006 ACM SIGPLAN workshop on Haskell",
    "location": "Portland, Oregon, USA",
    "url": "http://www.haskell.org/haskell-workshop/2006/",
    "series": "Haskell '06",
    "pages": "25-36",
    "note": "This paper is supported by the CoddFish library"
  },
  "download": "/files/hw2006.pdf",
  "abstract": "<p>Haskell's type system with multi-parameter constructor classes and functional dependencies allows static (compile-time) computations to be expressed by logic programming on the level of types. This emergent capability has been exploited for instance to model arbitrary-length tuples (heterogeneous lists), extensible records, functions with variable length argument lists, and (homogenous) lists of statically fixed length (vectors).We explain how type-level programming can be exploited to define a strongly-typed model of relational databases and operations on them. In particular, we present a strongly typed embedding of a significant subset of SQL in Haskell. In this model, meta-data is represented by type-level entities that guard the semantic correctness of database operations at compile time.Apart from the standard relational database operations, such as selection and join, we model functional dependencies (among table attributes), normal forms, and operations for database transformation. We show how functional dependency information can be represented at the type level, and can be transported through operations. This means that type inference statically computes functional dependencies on the result from those on the arguments.Our model shows that Haskell can be used to design and prototype typed languages for designing, programming, and transforming relational databases.</p>"

}, {
  "year": 2006,
  "id": "BS06",
  "authors": ["Luís Barbosa", "Alexandra Silva"],
  "unpublished": "Short Contributions CMCS'06, Int. Workshop on Coalgebraic Methods in Computer Science, Wien, Austria, 2006",
  "title": "A calculational account of lambda-coinduction"
}]
